[
  {
    "chapter": "186",
    "section": "Section 1A",
    "section_title": "Section 1A",
    "text": "Section 1A. If land is demised for the term of 100 years or more, the term shall, so long as 50 years thereof remain unexpired, be regarded as an estate in fee simple as to everything concerning the descent and devise thereof upon the decease of the owner, the sale thereof by personal representatives, guardians, conservators or trustees, the levy of execution thereon and the redemption thereof if mortgaged or taken on execution. Whoever holds as lessee or assignee under such a lease shall, so long as 50 years of the term remain unexpired, be regarded as a freeholder for all purposes.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 3",
    "section_title": "Section 3",
    "text": "Section 3. Tenants at sufferance in possession of land or tenements shall be liable to pay rent therefor for such time as they may occupy or detain the same.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 4",
    "section_title": "Section 4",
    "text": "Section 4. A person in possession of land out of which rent is due shall be liable for the amount or proportion of rent due from the land in his possession although it is only a part of that originally demised.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 5",
    "section_title": "Section 5",
    "text": "Section 5. Such rent may be recovered in contract, and the deed of demise or other written instrument, if any, showing the provisions of the lease, may be used in evidence by either party to prove the amount of rent due from the defendant.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 6",
    "section_title": "Section 6",
    "text": "Section 6. Such action may be brought by or against executors and administrators for any arrears of rent accrued in the lifetime of the deceased parties, respectively, in the same manner as for debts due from or to the same parties in their lifetime on a personal contract.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 7",
    "section_title": "Section 7",
    "text": "Section 7. The six preceding sections shall not deprive landlords of any other legal remedy for the recovery of rents, whether secured by lease or by law.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 8",
    "section_title": "Section 8",
    "text": "Section 8. If land is held by lease of a person having an estate therein determinable on a life or on a contingency, and such estate determines before the end of a period for which rent is payable, or if an estate created by a written lease or an estate at will is determined before the end of such period by surrender, either express or by operation of law, by notice to quit for non-payment of rent, or by the death of any party, the landlord or his executor or administrator may recover in contract, a proportional part of such rent according to the portion of the last period for which such rent was accruing which had expired at such determination.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 9",
    "section_title": "Section 9",
    "text": "Section 9. If, upon the determination of a tenancy, in any manner mentioned in the preceding section, before the end of a period for which rent is payable, the rent therefor has been paid before such determination, a proportionate part thereof, according to the portion of such period then unexpired, may be recovered back in contract.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 10",
    "section_title": "Section 10",
    "text": "Section 10. Debts for the rent of a dwelling house occupied by the debtor or his family shall be considered as claims for necessaries.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 11",
    "section_title": "Section 11",
    "text": "Section 11. Upon the neglect or refusal to pay the rent due under a written lease, fourteen days' notice to quit, given in writing by the landlord to the tenant, shall be sufficient to determine the lease, unless the tenant, on or before the day the answer is due, in an action by the landlord to recover possession of the premises, pays or tenders to the landlord or to his attorney all rent then due, with interest and costs of suit. If the neglect or refusal to pay the rent due was caused by a failure or delay of the federal government, the commonwealth or any municipality, or any departments, agencies or authorities thereof, in the mailing or delivery of any subsistence or rental payment, check or voucher other than a salary payment to either the tenant or the landlord, the court in any such action shall continue the hearing not less than seven days in order to furnish notice of such action to the appropriate agency and shall, if all rent due with interest and costs of suit has been tendered to the landlord within such time, treat the tenancy as not having been terminated.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 11A",
    "section_title": "Section 11A",
    "text": "Section 11A. Upon the neglect or refusal by the tenant to pay the rent due under a written lease of premises for other than dwelling purposes, the landlord shall be entitled to terminate the lease either (i) in accordance with the provisions of the lease or (ii) in the absence of such lease provisions, by at least fourteen days notice to quit, given in writing to the tenant. If a landlord terminates the lease by at least fourteen days notice pursuant to clause (ii) of the preceding sentence, the tenant shall be entitled to cure on or before the day the answer is due in any action by the landlord to recover possession of the premises, by paying or tendering to the landlord or to his attorney all rent then due, with interest and costs of such action. The rights to cure provided herein, shall apply only to termination pursuant to clause (ii) and shall not apply to termination in accordance with the provisions of the lease.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 12",
    "section_title": "Section 12",
    "text": "Section 12. Estates at will may be determined by either party by three months' notice in writing for that purpose given to the other party; and, if the rent reserved is payable at periods of less than three months, the time of such notice shall be sufficient if it is equal to the interval between the days of payment or thirty days, whichever is longer. Such written notice may include an offer to establish a new tenancy for the same premises on terms different from that of the tenancy being terminated and the validity of such written notice shall not be affected by the inclusion of such offer. In case of neglect or refusal to pay the rent due from a tenant at will, fourteen days' notice to quit, given in writing by the landlord to the tenant, shall be sufficient to determine the tenancy; provided, that the tenancy of a tenant who has not received a similar notice from the landlord within the twelve months next preceding the receipt of such notice shall not be determined if the tenant, within ten days after the receipt thereof, pays or tenders to the landlord, the landlord's attorney, or the person to whom the tenant customarily pays rent, the full amount of any rent due. Every notice to determine an estate at will for nonpayment of rent shall contain the following notification to the tenant: ''If you have not received a notice to quit for nonpayment of rent within the last twelve months, you have a right to prevent termination of your tenancy by paying or tendering to your landlord, your landlord's attorney or the person to whom you customarily pay your rent the full amount of rent due within ten days after your receipt of this notice.''  If any notice to determine an estate at will for nonpayment of rent shall fail to contain such notification, the time within which the tenant receiving the notice would be entitled to pay or tender rent pursuant to this section shall be extended to the day the answer is due in any action by the landlord to recover possession of the premises. Failure to include such notice shall not otherwise affect the validity of the said notice. If the neglect or refusal to pay the rent due was caused by a failure or delay of the federal government, the commonwealth or any municipality, or any departments, agencies or authorities thereof, in the mailing or delivery of any subsistence or rental payment, check or voucher other than a salary payment to either the tenant or the landlord, the court in any action for possession shall continue the hearing not less than seven days in order to furnish notice of such action to the appropriate agency and shall, if all rent due with interest and costs of suit has been tendered to the landlord within such time, treat the tenancy as not having been terminated.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 13",
    "section_title": "Section 13",
    "text": "Section 13. Whenever a tenancy at will of premises occupied for dwelling purposes, other than a room or rooms in a hotel, is terminated, without fault of the tenant, either by operation of law or by act of the landlord, except as provided in section twelve, no action to recover possession of the premises shall be brought, nor shall the tenant be dispossessed, until after the expiration of a period, equal to the interval between the days on which the rent reserved is payable or thirty days, whichever is longer, from the time when the tenant receives notice in writing of such termination; but such tenant shall be liable to pay rent for such time during the said period as he occupies or retains the premises, at the same rate as theretofore payable by him while a tenant at will; provided, that in the case of a rooming house, an action to recover possession of premises occupied for dwelling purposes may be brought seven days after written notice if the rent is payable on either a weekly or daily basis. A tenancy at will of property occupied for dwelling purposes shall not be terminated by operation of law by the conveyance, transfer or leasing of the premises by the owner or landlord thereof or by foreclosure.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 13A",
    "section_title": "Section 13A",
    "text": "Section 13A. Upon a foreclosure of residential real property pursuant to chapter 244, a tenant, occupying a dwelling unit under an unexpired term for years or a lease for a definite term in effect at the time of the foreclosure by sale, shall be deemed a tenant at will. Foreclosure shall not affect the tenancy agreement of a tenant whose rental payment is subsidized under state or federal law and the foreclosing entity shall assume the lease and rental subsidy contract with the rental subsidy administrator.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 14",
    "section_title": "Section 14",
    "text": "Section 14. Any lessor or landlord of any building or part thereof occupied for dwelling purposes, other than a room or rooms in a hotel, but including a manufactured home or land therefor, who is required by law or by the express or implied terms of any contract or lease or tenancy at will to furnish water, hot water, heat, light, power, gas, elevator service, telephone service, janitor service or refrigeration service to any occupant of such building or part thereof, who willfully or intentionally fails to furnish such water, hot water, heat, light, power, gas, elevator service, telephone service, janitor service or refrigeration service at any time when the same is necessary to the proper or customary use of such building or part thereof, or any lessor or landlord who directly or indirectly interferes with the furnishing by another of such utilities or services, or who transfers the responsibility for payment for any utility services to the occupant without his knowledge or consent, or any lessor or landlord who directly or indirectly interferes with the quiet enjoyment of any residential premises by the occupant, or who attempts to regain possession of such premises by force without benefit of judicial process, shall be punished by a fine of not less than twenty-five dollars nor more than three hundred dollars, or by imprisonment for not more than six months. Any person who commits any act in violation of this section shall also be liable for actual and consequential damages or three month's rent, whichever is greater, and the costs of the action, including a reasonable attorney's fee, all of which may be applied in setoff to or in recoupment against any claim for rent owed or owing. The superior and district courts shall have jurisdiction in equity to restrain violations of this section. The provisions of section eighteen of chapter one hundred and eighty-six and section two A of chapter two hundred and thirty-nine shall apply to any act taken as a reprisal against any person for reporting or proceeding against violations of this section. Any waiver of this provision in any lease or other rental agreement, except with respect to any restriction on the provision of a service specified in this section imposed by the United States or any agency thereof or the commonwealth or any agency or political subdivision thereof and not resulting from the acts or omissions of the landlord or lessor, and except for interruptions of any specified service during the time required to perform necessary repairs to apparatus necessary for the delivery of said service or interruptions resulting from natural causes beyond the control of the lessor or landlord, shall be void and unenforceable.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 15",
    "section_title": "Section 15",
    "text": "Section 15. Any provision of a lease or other rental agreement relating to real property whereby a lessee or tenant enters into a covenant, agreement or contract, by the use of any words whatsoever, the effect of which is to indemnify the lessor or landlord or hold the lessor or landlord harmless, or preclude or exonerate the lessor or landlord from any or all liability to the lessee or tenant, or to any other person, for any injury, loss, damage or liability arising from any omission, fault, negligence or other misconduct of the lessor or landlord on or about the leased or rented premises or on or about any elevators, stairways, hallways or other appurtenance used in connection therewith, shall be deemed to be against public policy and void.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 15A",
    "section_title": "Section 15A",
    "text": "Section 15A. Any provision of a lease or other rental agreement relating to residential real property whereby a lessee or tenant enters into a covenant, agreement or contract, by the use of any words whatsoever, the effect of which is to waive the notices required under section eleven or twelve, shall be deemed to be against public policy and void.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 15B",
    "section_title": "Section 15B",
    "text": "Section 15B. (1) (a) No lease relating to residential real property shall contain a provision that a lessor may, except to inspect the premises, to make repairs thereto or to show the same to a prospective tenant, purchaser, mortgagee or its agents, enter the premises before the termination date of such lease. A lessor may, however, enter such premises:(i) in accordance with a court order;(ii) if the premises appear to have been abandoned by the lessee;  or(iii) to inspect, within the last thirty days of the tenancy or after either party has given notice to the other of intention to terminate the tenancy, the premises for the purpose of determining the amount of damage, if any, to the premises which would be cause for deduction from any security deposit held by the lessor pursuant to this section.(b) At or prior to the commencement of any tenancy, no lessor may require a tenant or prospective tenant to pay any amount in excess of the following:(i) rent for the first full month of occupancy;  and,(ii) rent for the last full month of occupancy calculated at the same rate as the first month;  and,[ Paragraph (iii) of clause (b) of subsection (1) effective until August 6, 2024. For text effective August 6, 2024, see below.](iii) a security deposit equal to the first month's rent provided that such security deposit is deposited as required by subsection (3) and that the tenant is given the statement of condition as required by subsection (2);  and,[ Paragraph (iii) of clause (b) of subsection (1) as amended by 2024, 150, Sec. 50 effective August 6, 2024. For text effective until August 6, 2024, see above.](iii) a security deposit equal to the first month's rent provided that such security deposit is deposited as required by subsection (3) and that the tenant is given the statement of condition as required by subsection (2);  provided, however, that the executive office of housing and livable communities may promulgate regulations to authorize a lessor and a tenant or prospective tenant to agree to the payment of a fee in lieu of payment of a security deposit;  provided further, that any such regulations shall:  (A) require the lessor to utilize a fee collected to waive a security deposit to cover for unpaid rent or unit damage that applies to the tenant's lease;  (B) require that a fee so collected be:  (I) entirely or partially non-refundable;  provided, however, that the lessor shall disclose that the fee is non-refundable in the lease;  provided further, that the tenant shall agree to the fee and acknowledge that the tenant understand that it is entirely or partially non-refundable, as the case may be, in writing;  and (II) a recurring monthly fee, or payable upon any schedule and in an amount that the lessor and tenant agree upon, as authorized by the executive office;  (C) limit the total sum of the fee or recurring payments, regardless of the duration of the lease and any extensions thereto, to an amount not to exceed 1 month's rent;  (D) require that the fee be made optional for both the tenant and the lessor and that the tenant be permitted to choose to pay a full security deposit rather than the fee;  (E) require a lessor who offers such a fee in lieu of security deposit:  (I) to offer the option of a fee in lieu of a security deposit to every prospective tenant whose application for occupancy has been approved, regardless of income, race, gender, gender identity, disability, sexual orientation, immigration status, size of household or credit score;  and (II) not to consider such factors and categories when setting the amount of the fee;  and (F) allow a tenant who agrees to pay a fee to waive a security deposit to opt-out of the obligation to pay such fee if such tenant pays the security deposit that would otherwise be in effect for the tenant's apartment on the day the tenant chooses to opt-out of such fee;  provided further, that the sum of fees paid to waive a security deposit and the payment of the security deposit shall not exceed, in total, the amount of 1 month's rent;  and provided further, that the executive office shall consult with the office of the attorney general prior to promulgating regulations authorizing a fee in lieu of a security deposit under this section;  and,(iv) the purchase and installation cost for a key and lock.(c) No lease or other rental agreement shall impose any interest or penalty for failure to pay rent until thirty days after such rent shall have been due.(d) No lessor or successor in interest shall at any time subsequent to the commencement of a tenancy demand rent in advance in excess of the current month's rent or a security deposit in excess of the amount allowed by this section. The payment in advance for occupancy pursuant to this section shall be binding upon all successors in interest.(e) A security deposit shall continue to be the property of the tenant making such deposit, shall not be commingled with the assets of the lessor, and shall not be subject to the claims of any creditor of the lessor or of the lessor's successor in interest, including a foreclosing mortgagee or trustee in bankruptcy;  provided, however, that the tenant shall be entitled to only such interest as is provided for in subsection (3)(b).(2)(a) Any lessor or his agent who receives, at or prior to the commencement of a tenancy, rent in advance for the last month of the tenancy from a tenant or prospective tenant shall give to such tenant or prospective tenant at the time of such advance payment a receipt indicating the amount of such rent, the date on which it was received, its intended application as rent for the last month of the tenancy, the name of the person receiving it and, in the case of an agent, the name of the lessor for whom the rent is received, and a description of the rented or leased premises, and a statement indicating that the tenant is entitled to interest on said rent payment at the rate of five per cent per year or other such lesser amount of interest as has been received from the bank where the deposit has been held payable in accordance with the provisions of this clause, and a statement indicating that the tenant should provide the lessor with a forwarding address at the termination of the tenancy indicating where such interest may be given or sent.Any lessor or his agent who receives said rent in advance for the last month of tenancy shall, beginning with the first day of tenancy, pay interest at the rate of five per cent per year or other such lesser amount of interest as has been received from the bank where the deposit has been held. Such interest shall be paid over to the tenant each year as provided in this clause;  provided, however, that in the event that the tenancy is terminated before the anniversary date of such tenancy, the tenant shall receive all accrued interest within thirty days of such termination. Interest shall not accrue for the last month for which rent was paid in advance. At the end of each year of tenancy, such lessor shall give or send to the tenant from whom rent in advance was collected a statement which shall indicate the amount payable by such lessor to the tenant. The lessor shall at the same time give or send to such tenant the interest which is due or shall notify the tenant that he may deduct the interest from the next rental payment of such tenant. If, after thirty days from the end of each year of the tenancy, the tenant has not received said interest due or said notice to deduct the interest from the next rental payment, the tenant may deduct from his next rent payment the interest due.If the lessor fails to pay any interest to which the tenant is then entitled within thirty days after the termination of the tenancy, the tenant upon proof of the same in an action against the lessor shall be awarded damages in an amount equal to three times the amount of interest to which the tenant is entitled, together with court costs and reasonable attorneys fees.(b) Any lessor or his agent who receives a security deposit from a tenant or prospective tenant shall give said tenant or prospective tenant at the time of receiving such security deposit a receipt indicating the amount of such security deposit, the name of the person receiving it and, in the case of an agent, the name of the lessor for whom such security deposit is received, the date on which it is received, and a description of the premises leased or rented. Said receipt shall be signed by the person receiving the security deposit.(c) Any lessor of residential real property, or his agent, who accepts a security deposit from a tenant or prospective tenant shall, upon receipt of such security deposit, or within ten days after commencement of the tenancy, whichever is later, furnish to such tenant or prospective tenant a separate written statement of the present condition of the premises to be leased or rented. Such written statement shall also contain a comprehensive listing of any damage then existing in the premises, including, but not limited to, any violations of the state sanitary or state building codes certified by a local board of health or building official or adjudicated by a court and then existing in the premises. Such statement shall be signed by the lessor or his agent and contain the following notice in twelve-point bold-face type at the top of the first page thereof:\"This is a statement of the condition of the premises you have leased or rented. You should read it carefully in order to see if it is correct. If it is correct you must sign it. This will show that you agree that the list is correct and complete. If it is not correct, you must attach a separate signed list of any damage which you believe exists in the premises. This statement must be returned to the lessor or his agent within fifteen days after you receive this list or within fifteen days after you move in, whichever is later. If you do not return this list, within the specified time period, a court may later view your failure to return the list as your agreement that the list is complete and correct in any suit which you may bring to recover the security deposit.''If the tenant submits to the lessor or his agent a separate list of damages, the lessor or his agent shall, within fifteen days of receiving said separate list, return a copy of said list to the tenant with either such lessor's signed agreement with the content thereof or a clear statement of disagreement attached.(d) Every lessor who accepts a security deposit shall maintain a record of all such security deposits received which contains the following information:--(i) a detailed description of any damage done to each of the dwelling units or premises for which a security deposit has been accepted, returned to any tenant thereof or for which the lessor has brought suit against any tenant;(ii) the date upon which the occupancy of the tenant or tenants charged with such damage was terminated;  and(iii) whether repairs were performed to remedy such damage, the dates of said repairs, the cost thereof, and receipts therefor.Said record shall also include copies of any receipt or statement of condition given to a tenant or prospective tenant as required by this section.Said record shall be available for inspection upon request of a tenant or prospective tenant during normal business hours in the office of the lessor or his agent. Upon a wrongful failure by the lessor or his agent to make such record available for inspection by a tenant or prospective tenant, said tenant or prospective tenant shall be entitled to the immediate return of any amount paid in the form of a security deposit together with any interest which has accrued thereon.The lessor or his agent shall maintain said record for each dwelling unit or premises for which a security deposit was accepted for a period of two years from the date of termination of the tenancy or occupancy upon which the security deposit was conditioned.(3) (a) Any security deposit received by such lessor shall be held in a separate, interest-bearing account in a bank, located within the commonwealth under such terms as will place such deposit beyond the claim of creditors of the lessor, including a foreclosing mortgagee or trustee in bankruptcy, and as will provide for its transfer to a subsequent owner of said property. A receipt shall be given to the tenant within thirty days after such deposit is received by the lessor which receipt shall indicate the name and location of the bank in which the security deposit has been deposited and the amount and account number of said deposit. Failure to comply with this paragraph shall entitle the tenant to immediate return of the security deposit.(b) A lessor of residential real property who holds a security deposit pursuant to this section for a period of one year or longer from the commencement of the term of the tenancy shall, beginning with the first day of the tenancy, pay interest at the rate of five per cent per year, or other such lesser amount of interest as has been received from the bank where the deposit has been held payable to the tenant at the end of each year of the tenancy. Such interest shall be paid over to the tenant each year as provided in this clause, provided, however, that in the event that the tenancy is terminated before the anniversary date of the tenancy, the tenant shall receive all accrued interest within thirty days of such termination. Such interest shall be beyond the claims of such lessor, except as provided for in this section. At the end of each year of a tenancy, such lessor shall give or send to the tenant from whom a security deposit has been received a statement which shall indicate the name and address of the bank in which the security deposit has been placed, the amount of the deposit, the account number, and the amount of interest payable by such lessor to the tenant. The lessor shall at the same time give or send to each such tenant the interest which is due or shall include with the statement required by this clause a notification that the tenant may deduct the interest from the tenant's next rental payment. If, after thirty days from the end of each year of the tenancy, the tenant has not received such notice or payment, the tenant may deduct from his next rent payment the interest due.(4) The lessor shall, within thirty days after the termination of occupancy under a tenancy-at-will or the end of the tenancy as specified in a valid written lease agreement, return to the tenant the security deposit or any balance thereof;  provided, however, that the lessor may deduct from such security deposit for the following:(i) any unpaid rent or water charges which have not been validly withheld or deducted pursuant to any general or special law(ii) any unpaid increase in real estate taxes which the tenant is obligated to pay pursuant to a tax escalation clause which conforms to the requirements of section fifteen C;  and(iii) a reasonable amount necessary to repair any damage caused to the dwelling unit by the tenant or any person under the tenant's control or on the premises with the tenant's consent, reasonable wear and tear excluded. In the case of such damage, the lessor shall provide to the tenant within such thirty days an itemized list of damages, sworn to by the lessor or his agent under pains and penalties of perjury, itemizing in precise detail the nature of the damage and of the repairs necessary to correct such damage, and written evidence, such as estimates, bills, invoices or receipts, indicating the actual or estimated cost thereof. No amount shall be deducted from the security deposit for any damage to the dwelling unit which was listed in the separate written statement of the present condition of the premises which was required to be given to the tenant prior to the execution of the lease or creation of the tenancy pursuant to clause (c) of subsection (2) or any damages listed in any separate list submitted by the tenant and signed by the lessor or his agent pursuant to said clause (c), unless the lessor subsequently repaired or caused to be repaired said damage and can prove that the renewed damage was unrelated to the prior damage and was caused by the tenant or by any person under the tenant's control or on the premises with the tenant's consent. Nothing in this section shall limit the right of a landlord to recover from a tenant, who wilfully or maliciously destroys or damages the real or personal property of said landlord, to the forfeiture of a security deposit, when the cost of repairing or replacing such property exceeds the amount of such security deposit.No deduction may be made from the security deposit for any purpose other than those set forth in this section.(5) Whenever a lessor who receives a security deposit transfers his interest in the dwelling unit for which the security deposit is held, whether by sale, assignment, death, appointment of a receiver or trustee in bankruptcy, or otherwise, the lessor shall transfer such security deposit together with any interest which has accrued thereon for the benefit of the tenant who made such security deposit to his successor in interest, and said successor in interest shall be liable for the retention and return of said security deposit in accordance with the provisions of this section from the date upon which said transfer is made;  provided however, that the granting of a mortgage on such premises shall not be a transfer of interest. The successor in interest shall, within forty-five days from the date of said transfer, notify the tenant who made such security deposit that such security deposit was transferred to him and that he is holding said security deposit. Such notice shall also contain the lessor's name, business address, and business telephone number, and the name, business address, and business telephone number of his agent, if any. Said notice shall be in writing.Upon such transfer, the lessor or his agent shall continue to be liable with respect to the provisions of this section until:(a) there has been a transfer of the amount of the security deposit so held to the lessor's successor in interest and the tenant has been notified in writing of the transfer and of the successor in interest's name, business address, and business telephone number;(b) there has been compliance with this clause by the successor in interest;  or(c) the security deposit has been returned to the tenant.In the event that the lessor fails to transfer said security deposit to his successor in interest as required by this subsection the successor in interest shall, without regard to the nature of the transfer, assume liability for payment of the security deposit to the tenant in accordance with the provisions of this section;  provided, however, that if the tenant still occupies the dwelling unit for which the security deposit was given, said successor in interest may satisfy such obligation by granting the tenant free use and occupancy of the dwelling unit for a period of time equivalent to that period of time for which the dwelling unit could be leased or occupied if the security deposit were deemed to be rent. The liability imposed by this paragraph shall not apply to a city or town which acquires title to property pursuant to chapter sixty or to a foreclosing mortgagee or a mortgagee in possession which is a financial institution chartered by the commonwealth or the United States. The term \"rent'', as used in the preceding sentence, shall mean the periodic sum paid by the tenant for the use and occupation of the dwelling unit in accordance with the terms of his lease or other rental agreement.(6) The lessor shall forfeit his right to retain any portion of the security deposit for any reason, or, in any action by a tenant to recover a security deposit, to counterclaim for any damage to the premises if he:(a) fails to deposit such funds in an account as required by subsection (3);(b) fails to furnish to the tenant within thirty days after the termination of the occupancy the itemized list of damages, if any, in compliance with the provisions of this section;(c) uses in any lease signed by the tenant any provision which conflicts with any provision of this section and attempts to enforce such provision or attempts to obtain from the tenant or prospective tenant a waiver of any provision of this section;(d) fails to transfer such security deposit to his successor in interest or to otherwise comply with the provisions of subsection (5) after he has succeeded to an interest in residential real property;  or,(e) fails to return to the tenant the security deposit or balance thereof to which the tenant is entitled after deducting therefrom any sums in accordance with the provisions of this section, together with any interest thereon, within thirty days after termination of the tenancy.(7) If the lessor or his agent fails to comply with clauses (a), (d), or (e) of subsection 6, the tenant shall be awarded damages in an amount equal to three times the amount of such security deposit or balance thereof to which the tenant is entitled plus interest at the rate of five per cent from the date when such payment became due, together with court costs and reasonable attorney's fees.(7A) Whenever a lessor who receives rent in advance for the last month of tenancy transfers his interest in the dwelling unit for which the rental advance was received, whether by sale, assignment, death, appointment of a receiver or trustee in bankruptcy, or otherwise, the lessor shall credit an amount equal to such rental advance together with any interest which has accrued thereon for the benefit of the tenant who made such rental advance, to the successor in interest of such lessor, and said successor in interest shall be liable for crediting the tenant with such rental advance, and for paying all interest accrued thereon in accordance with the provisions of this section from the date upon which said transfer is made;  provided, however, that the granting of a mortgage on such premises shall not be deemed a transfer of interest. The successor in interest shall, within forty-five days from the date of said transfer, notify the tenant who made such rental advance that such rental advance was so credited, and that such successor has assumed responsibility therefor pursuant to the foregoing provision. Such notice shall also contain the lessor's name, business address, and business telephone number, and the name, business address, and business telephone number of his agent, if any. Said notice shall be in writing.Upon such transfer, the lessor or his agent shall continue to be liable with respect to the provisions of this section until:--(a) there has been a credit of the amount of the rental advance so held to the lessor's successor in interest and the tenant has been notified in writing of the transfer and of the successor in interest's name, business address, and business telephone number;  (b) there has been compliance with this clause by the successor in interest;  or (c) the rental advance has been credited to the tenant and all accrued interest has been paid thereon.In the event that the lessor fails to credit said rental advance to his successor in interest as required by this subsection, the successor in interest shall, without regard to the nature of the transfer, assume liability for crediting of the rental advance, and payment of all interest thereon to the tenant in accordance with the provisions of this section;  provided, however, that if the tenant still occupies the dwelling unit for which the rental advance was given, said successor in interest may satisfy such obligation by granting the tenant free use and occupancy of the dwelling unit for a period of time equivalent to the period of time covered by the rental advance.",
    "chunk_index": 1,
    "total_chunks": 3
  },
  {
    "chapter": "186",
    "section": "Section 15B",
    "section_title": "Section 15B",
    "text": "The liability imposed by this subsection shall not apply to a city or town which acquires title to property pursuant to chapter sixty or to a foreclosing mortgagee or a mortgagee in possession which is a financial institution chartered by the commonwealth or by the United States.(8) Any provision of a lease which conflicts with any provision of this section and any waiver by a tenant or prospective tenant of any provision of this section shall be deemed to be against public policy and therefore void and unenforceable.(9) The provisions of this section shall not apply to any lease, rental, occupancy or tenancy of one hundred days or less in duration which lease or rental is for a vacation or recreational purpose. Section 15B. (1) (a) No lease relating to residential real property shall contain a provision that a lessor may, except to inspect the premises, to make repairs thereto or to show the same to a prospective tenant, purchaser, mortgagee or its agents, enter the premises before the termination date of such lease. A lessor may, however, enter such premises: (i) in accordance with a court order; (ii) if the premises appear to have been abandoned by the lessee;  or (iii) to inspect, within the last thirty days of the tenancy or after either party has given notice to the other of intention to terminate the tenancy, the premises for the purpose of determining the amount of damage, if any, to the premises which would be cause for deduction from any security deposit held by the lessor pursuant to this section. (b) At or prior to the commencement of any tenancy, no lessor may require a tenant or prospective tenant to pay any amount in excess of the following: (i) rent for the first full month of occupancy;  and, (ii) rent for the last full month of occupancy calculated at the same rate as the first month;  and, [ Paragraph (iii) of clause (b) of subsection (1) effective until August 6, 2024. For text effective August 6, 2024, see below.] (iii) a security deposit equal to the first month's rent provided that such security deposit is deposited as required by subsection (3) and that the tenant is given the statement of condition as required by subsection (2);  and, [ Paragraph (iii) of clause (b) of subsection (1) as amended by 2024, 150, Sec. 50 effective August 6, 2024. For text effective until August 6, 2024, see above.] (iii) a security deposit equal to the first month's rent provided that such security deposit is deposited as required by subsection (3) and that the tenant is given the statement of condition as required by subsection (2);  provided, however, that the executive office of housing and livable communities may promulgate regulations to authorize a lessor and a tenant or prospective tenant to agree to the payment of a fee in lieu of payment of a security deposit;  provided further, that any such regulations shall:  (A) require the lessor to utilize a fee collected to waive a security deposit to cover for unpaid rent or unit damage that applies to the tenant's lease;  (B) require that a fee so collected be:  (I) entirely or partially non-refundable;  provided, however, that the lessor shall disclose that the fee is non-refundable in the lease;  provided further, that the tenant shall agree to the fee and acknowledge that the tenant understand that it is entirely or partially non-refundable, as the case may be, in writing;  and (II) a recurring monthly fee, or payable upon any schedule and in an amount that the lessor and tenant agree upon, as authorized by the executive office;  (C) limit the total sum of the fee or recurring payments, regardless of the duration of the lease and any extensions thereto, to an amount not to exceed 1 month's rent;  (D) require that the fee be made optional for both the tenant and the lessor and that the tenant be permitted to choose to pay a full security deposit rather than the fee;  (E) require a lessor who offers such a fee in lieu of security deposit:  (I) to offer the option of a fee in lieu of a security deposit to every prospective tenant whose application for occupancy has been approved, regardless of income, race, gender, gender identity, disability, sexual orientation, immigration status, size of household or credit score;  and (II) not to consider such factors and categories when setting the amount of the fee;  and (F) allow a tenant who agrees to pay a fee to waive a security deposit to opt-out of the obligation to pay such fee if such tenant pays the security deposit that would otherwise be in effect for the tenant's apartment on the day the tenant chooses to opt-out of such fee;  provided further, that the sum of fees paid to waive a security deposit and the payment of the security deposit shall not exceed, in total, the amount of 1 month's rent;  and provided further, that the executive office shall consult with the office of the attorney general prior to promulgating regulations authorizing a fee in lieu of a security deposit under this section;  and, (iv) the purchase and installation cost for a key and lock. (c) No lease or other rental agreement shall impose any interest or penalty for failure to pay rent until thirty days after such rent shall have been due. (d) No lessor or successor in interest shall at any time subsequent to the commencement of a tenancy demand rent in advance in excess of the current month's rent or a security deposit in excess of the amount allowed by this section. The payment in advance for occupancy pursuant to this section shall be binding upon all successors in interest. (e) A security deposit shall continue to be the property of the tenant making such deposit, shall not be commingled with the assets of the lessor, and shall not be subject to the claims of any creditor of the lessor or of the lessor's successor in interest, including a foreclosing mortgagee or trustee in bankruptcy;  provided, however, that the tenant shall be entitled to only such interest as is provided for in subsection (3)(b). (2)(a) Any lessor or his agent who receives, at or prior to the commencement of a tenancy, rent in advance for the last month of the tenancy from a tenant or prospective tenant shall give to such tenant or prospective tenant at the time of such advance payment a receipt indicating the amount of such rent, the date on which it was received, its intended application as rent for the last month of the tenancy, the name of the person receiving it and, in the case of an agent, the name of the lessor for whom the rent is received, and a description of the rented or leased premises, and a statement indicating that the tenant is entitled to interest on said rent payment at the rate of five per cent per year or other such lesser amount of interest as has been received from the bank where the deposit has been held payable in accordance with the provisions of this clause, and a statement indicating that the tenant should provide the lessor with a forwarding address at the termination of the tenancy indicating where such interest may be given or sent. Any lessor or his agent who receives said rent in advance for the last month of tenancy shall, beginning with the first day of tenancy, pay interest at the rate of five per cent per year or other such lesser amount of interest as has been received from the bank where the deposit has been held. Such interest shall be paid over to the tenant each year as provided in this clause;  provided, however, that in the event that the tenancy is terminated before the anniversary date of such tenancy, the tenant shall receive all accrued interest within thirty days of such termination. Interest shall not accrue for the last month for which rent was paid in advance. At the end of each year of tenancy, such lessor shall give or send to the tenant from whom rent in advance was collected a statement which shall indicate the amount payable by such lessor to the tenant. The lessor shall at the same time give or send to such tenant the interest which is due or shall notify the tenant that he may deduct the interest from the next rental payment of such tenant. If, after thirty days from the end of each year of the tenancy, the tenant has not received said interest due or said notice to deduct the interest from the next rental payment, the tenant may deduct from his next rent payment the interest due. If the lessor fails to pay any interest to which the tenant is then entitled within thirty days after the termination of the tenancy, the tenant upon proof of the same in an action against the lessor shall be awarded damages in an amount equal to three times the amount of interest to which the tenant is entitled, together with court costs and reasonable attorneys fees. (b) Any lessor or his agent who receives a security deposit from a tenant or prospective tenant shall give said tenant or prospective tenant at the time of receiving such security deposit a receipt indicating the amount of such security deposit, the name of the person receiving it and, in the case of an agent, the name of the lessor for whom such security deposit is received, the date on which it is received, and a description of the premises leased or rented. Said receipt shall be signed by the person receiving the security deposit. (c) Any lessor of residential real property, or his agent, who accepts a security deposit from a tenant or prospective tenant shall, upon receipt of such security deposit, or within ten days after commencement of the tenancy, whichever is later, furnish to such tenant or prospective tenant a separate written statement of the present condition of the premises to be leased or rented. Such written statement shall also contain a comprehensive listing of any damage then existing in the premises, including, but not limited to, any violations of the state sanitary or state building codes certified by a local board of health or building official or adjudicated by a court and then existing in the premises. Such statement shall be signed by the lessor or his agent and contain the following notice in twelve-point bold-face type at the top of the first page thereof: \"This is a statement of the condition of the premises you have leased or rented. You should read it carefully in order to see if it is correct. If it is correct you must sign it. This will show that you agree that the list is correct and complete. If it is not correct, you must attach a separate signed list of any damage which you believe exists in the premises. This statement must be returned to the lessor or his agent within fifteen days after you receive this list or within fifteen days after you move in, whichever is later. If you do not return this list, within the specified time period, a court may later view your failure to return the list as your agreement that the list is complete and correct in any suit which you may bring to recover the security deposit.'' If the tenant submits to the lessor or his agent a separate list of damages, the lessor or his agent shall, within fifteen days of receiving said separate list, return a copy of said list to the tenant with either such lessor's signed agreement with the content thereof or a clear statement of disagreement attached. (d) Every lessor who accepts a security deposit shall maintain a record of all such security deposits received which contains the following information:-- (i) a detailed description of any damage done to each of the dwelling units or premises for which a security deposit has been accepted, returned to any tenant thereof or for which the lessor has brought suit against any tenant; (ii) the date upon which the occupancy of the tenant or tenants charged with such damage was terminated;  and (iii) whether repairs were performed to remedy such damage, the dates of said repairs, the cost thereof, and receipts therefor. Said record shall also include copies of any receipt or statement of condition given to a tenant or prospective tenant as required by this section. Said record shall be available for inspection upon request of a tenant or prospective tenant during normal business hours in the office of the lessor or his agent. Upon a wrongful failure by the lessor or his agent to make such record available for inspection by a tenant or prospective tenant, said tenant or prospective tenant shall be entitled to the immediate return of any amount paid in the form of a security deposit together with any interest which has accrued thereon. The lessor or his agent shall maintain said record for each dwelling unit or premises for which a security deposit was accepted for a period of two years from the date of termination of the tenancy or occupancy upon which the security deposit was conditioned. (3) (a) Any security deposit received by such lessor shall be held in a separate, interest-bearing account in a bank, located within the commonwealth under such terms as will place such deposit beyond the claim of creditors of the lessor, including a foreclosing mortgagee or trustee in bankruptcy, and as will provide for its transfer to a subsequent owner of said property. A receipt shall be given to the tenant within thirty days after such deposit is received by the lessor which receipt shall indicate the name and location of the bank in which the security deposit has been deposited and the amount and account number of said deposit. Failure to comply with this paragraph shall entitle the tenant to immediate return of the security deposit. (b) A lessor of residential real property who holds a security deposit pursuant to this section for a period of one year or longer from the commencement of the term of the tenancy shall, beginning with the first day of the tenancy, pay interest at the rate of five per cent per year, or other such lesser amount of interest as has been received from the bank where the deposit has been held payable to the tenant at the end of each year of the tenancy. Such interest shall be paid over to the tenant each year as provided in this clause, provided, however, that in the event that the tenancy is terminated before the anniversary date of the tenancy, the tenant shall receive all accrued interest within thirty days of such termination. Such interest shall be beyond the claims of such lessor, except as provided for in this section. At the end of each year of a tenancy, such lessor shall give or send to the tenant from whom a security deposit has been received a statement which shall indicate the name and address of the bank in which the security deposit has been placed, the amount of the deposit, the account number, and the amount of interest payable by such lessor to the tenant. The lessor shall at the same time give or send to each such tenant the interest which is due or shall include with the statement required by this clause a notification that the tenant may deduct the interest from the tenant's next rental payment. If, after thirty days from the end of each year of the tenancy, the tenant has not received such notice or payment, the tenant may deduct from his next rent payment the interest due. (4) The lessor shall, within thirty days after the termination of occupancy under a tenancy-at-will or the end of the tenancy as specified in a valid written lease agreement, return to the tenant the security deposit or any balance thereof;  provided, however, that the lessor may deduct from such security deposit for the following: (i) any unpaid rent or water charges which have not been validly withheld or deducted pursuant to any general or special law (ii) any unpaid increase in real estate taxes which the tenant is obligated to pay pursuant to a tax escalation clause which conforms to the requirements of section fifteen C;  and (iii) a reasonable amount necessary to repair any damage caused to the dwelling unit by the tenant or any person under the tenant's control or on the premises with the tenant's consent, reasonable wear and tear excluded. In the case of such damage, the lessor shall provide to the tenant within such thirty days an itemized list of damages, sworn to by the lessor or his agent under pains and penalties of perjury, itemizing in precise detail the nature of the damage and of the repairs necessary to correct such damage, and written evidence, such as estimates, bills, invoices or receipts, indicating the actual or estimated cost thereof. No amount shall be deducted from the security deposit for any damage to the dwelling unit which was listed in the separate written statement of the present condition of the premises which was required to be given to the tenant prior to the execution of the lease or creation of the tenancy pursuant to clause (c) of subsection (2) or any damages listed in any separate list submitted by the tenant and signed by the lessor or his agent pursuant to said clause (c), unless the lessor subsequently repaired or caused to be repaired said damage and can prove that the renewed damage was unrelated to the prior damage and was caused by the tenant or by any person under the tenant's control or on the premises with the tenant's consent. Nothing in this section shall limit the right of a landlord to recover from a tenant, who wilfully or maliciously destroys or damages the real or personal property of said landlord, to the forfeiture of a security deposit, when the cost of repairing or replacing such property exceeds the amount of such security deposit. No deduction may be made from the security deposit for any purpose other than those set forth in this section. (5) Whenever a lessor who receives a security deposit transfers his interest in the dwelling unit for which the security deposit is held, whether by sale, assignment, death, appointment of a receiver or trustee in bankruptcy, or otherwise, the lessor shall transfer such security deposit together with any interest which has accrued thereon for the benefit of the tenant who made such security deposit to his successor in interest, and said successor in interest shall be liable for the retention and return of said security deposit in accordance with the provisions of this section from the date upon which said transfer is made;  provided however, that the granting of a mortgage on such premises shall not be a transfer of interest. The successor in interest shall, within forty-five days from the date of said transfer, notify the tenant who made such security deposit that such security deposit was transferred to him and that he is holding said security deposit. Such notice shall also contain the lessor's name, business address, and business telephone number, and the name, business address, and business telephone number of his agent, if any. Said notice shall be in writing. Upon such transfer, the lessor or his agent shall continue to be liable with respect to the provisions of this section until: (a) there has been a transfer of the amount of the security deposit so held to the lessor's successor in interest and the tenant has been notified in writing of the transfer and of the successor in interest's name, business address, and business telephone number; (b) there has been compliance with this clause by the successor in interest;  or (c) the security deposit has been returned to the tenant. In the event that the lessor fails to transfer said security deposit to his successor in interest as required by this subsection the successor in interest shall, without regard to the nature of the transfer, assume liability for payment of the security deposit to the tenant in accordance with the provisions of this section;  provided, however, that if the tenant still occupies the dwelling unit for which the security deposit was given, said successor in interest may satisfy such obligation by granting the tenant free use and occupancy of the dwelling unit for a period of time equivalent to that period of time for which the dwelling unit could be leased or occupied if the security deposit were deemed to be rent. The liability imposed by this paragraph shall not apply to a city or town which acquires title to property pursuant to chapter sixty or to a foreclosing mortgagee or a mortgagee in possession which is a financial institution chartered by the commonwealth or the United States. The term \"rent'', as used in the preceding sentence, shall mean the periodic sum paid by the tenant for the use and occupation of the dwelling unit in accordance with the terms of his lease or other rental agreement. (6) The lessor shall forfeit his right to retain any portion of the security deposit for any reason, or, in any action by a tenant to recover a security deposit, to counterclaim for any damage to the premises if he: (a) fails to deposit such funds in an account as required by subsection (3); (b) fails to furnish to the tenant within thirty days after the termination of the occupancy the itemized list of damages, if any, in compliance with the provisions of this section; (c) uses in any lease signed by the tenant any provision which conflicts with any provision of this section and attempts to enforce such provision or attempts to obtain from the tenant or prospective tenant a waiver of any provision of this section; (d) fails to transfer such security deposit to his successor in interest or to otherwise comply with the provisions of subsection (5) after he has succeeded to an interest in residential real property;  or, (e) fails to return to the tenant the security deposit or balance thereof to which the tenant is entitled after deducting therefrom any sums in accordance with the provisions of this section, together with any interest thereon, within thirty days after termination of the tenancy. (7) If the lessor or his agent fails to comply with clauses (a), (d), or (e) of subsection 6, the tenant shall be awarded damages in an amount equal to three times the amount of such security deposit or balance thereof to which the tenant is entitled plus interest at the rate of five per cent from the date when such payment became due, together with court costs and reasonable attorney's fees. (7A) Whenever a lessor who receives rent in advance for the last month of tenancy transfers his interest in the dwelling unit for which the rental advance was received, whether by sale, assignment, death, appointment of a receiver or trustee in bankruptcy, or otherwise, the lessor shall credit an amount equal to such rental advance together with any interest which has accrued thereon for the benefit of the tenant who made such rental advance, to the successor in interest of such lessor, and said successor in interest shall be liable for crediting the tenant with such rental advance, and for paying all interest accrued thereon in accordance with the provisions of this section from the date upon which said transfer is made;  provided, however, that the granting of a mortgage on such premises shall not be deemed a transfer of interest. The successor in interest shall, within forty-five days from the date of said transfer, notify the tenant who made such rental advance that such rental advance was so credited, and that such successor has assumed responsibility therefor pursuant to the foregoing provision. Such notice shall also contain the lessor's name, business address, and business telephone number, and the name, business address, and business telephone number of his agent, if any. Said notice shall be in writing. Upon such transfer, the lessor or his agent shall continue to be liable with respect to the provisions of this section until:--(a) there has been a credit of the amount of the rental advance so held to the lessor's successor in interest and the tenant has been notified in writing of the transfer and of the successor in interest's name, business address, and business telephone number;  (b) there has been compliance with this clause by the successor in interest;  or (c) the rental advance has been credited to the tenant and all accrued interest has been paid thereon.",
    "chunk_index": 2,
    "total_chunks": 3
  },
  {
    "chapter": "186",
    "section": "Section 15B",
    "section_title": "Section 15B",
    "text": "In the event that the lessor fails to credit said rental advance to his successor in interest as required by this subsection, the successor in interest shall, without regard to the nature of the transfer, assume liability for crediting of the rental advance, and payment of all interest thereon to the tenant in accordance with the provisions of this section;  provided, however, that if the tenant still occupies the dwelling unit for which the rental advance was given, said successor in interest may satisfy such obligation by granting the tenant free use and occupancy of the dwelling unit for a period of time equivalent to the period of time covered by the rental advance. The liability imposed by this subsection shall not apply to a city or town which acquires title to property pursuant to chapter sixty or to a foreclosing mortgagee or a mortgagee in possession which is a financial institution chartered by the commonwealth or by the United States. (8) Any provision of a lease which conflicts with any provision of this section and any waiver by a tenant or prospective tenant of any provision of this section shall be deemed to be against public policy and therefore void and unenforceable. (9) The provisions of this section shall not apply to any lease, rental, occupancy or tenancy of one hundred days or less in duration which lease or rental is for a vacation or recreational purpose.",
    "chunk_index": 3,
    "total_chunks": 3
  },
  {
    "chapter": "186",
    "section": "Section 15C",
    "section_title": "Section 15C",
    "text": "Section 15C. No lease relating to residential real estate shall contain a provision which obligates a lessee to make payments to the lessor on account of an increased real estate tax levied during the term of the lease, unless such provision expressly sets forth (1) that the lessee shall be obligated to pay only that proportion of such increased tax as the unit leased by him bears to the whole of the real estate so taxed, (2) the exact percentage of any such increase which the lessee shall pay, and (3) that if the lessor obtains an abatement of the real estate tax levied on the whole of the real estate of which the unit leased by the lessee is a part, a proportionate share of such abatement, less reasonable attorney's fees, if any, shall be refunded to said lessee. Any provision of a lease in violation of the provisions of this section shall be deemed to be against public policy and void.If the exact percentage of any such increased tax contained in such a provision is found to exceed that proportion of such increased tax as the lessee's unit bears to the whole of the real estate so taxed, then the lessor shall return to the lessee that amount of the tax payment collected from the lessee which exceeded the lessee's proportionate share of the increased tax, plus interest calculated at the rate of five per cent per year from the date of collection. Section 15C. No lease relating to residential real estate shall contain a provision which obligates a lessee to make payments to the lessor on account of an increased real estate tax levied during the term of the lease, unless such provision expressly sets forth (1) that the lessee shall be obligated to pay only that proportion of such increased tax as the unit leased by him bears to the whole of the real estate so taxed, (2) the exact percentage of any such increase which the lessee shall pay, and (3) that if the lessor obtains an abatement of the real estate tax levied on the whole of the real estate of which the unit leased by the lessee is a part, a proportionate share of such abatement, less reasonable attorney's fees, if any, shall be refunded to said lessee. Any provision of a lease in violation of the provisions of this section shall be deemed to be against public policy and void. If the exact percentage of any such increased tax contained in such a provision is found to exceed that proportion of such increased tax as the lessee's unit bears to the whole of the real estate so taxed, then the lessor shall return to the lessee that amount of the tax payment collected from the lessee which exceeded the lessee's proportionate share of the increased tax, plus interest calculated at the rate of five per cent per year from the date of collection.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 15D",
    "section_title": "Section 15D",
    "text": "Section 15D. A lessor who has agreed orally to execute a lease and obtains the signature of the lessee shall, within thirty days thereafter, deliver a copy of said lease to the lessee, duly signed and executed by said lessor. Whoever violates any provision of this section shall be punished by a fine of not more than three hundred dollars. Any waiver of this provision in any lease or other rental agreement shall be void and unenforceable.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 15E",
    "section_title": "Section 15E",
    "text": "Section 15E. An owner of a building shall be precluded from raising as a defense in an action brought by a lessee, tenant or occupant of said building who has sustained an injury caused by a defect in a common area, that said defect existed at the time of the letting of the property, if said defect is at the time of the injury a violation of the building code of the city or town wherein the property is situated. Any waiver of this provision in any lease or other rental agreement shall be void and unenforceable.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 15F",
    "section_title": "Section 15F",
    "text": "Section 15F. Any provision of a lease or other rental agreement relating to residential real property whereby the tenant agrees to waive his right to trial by jury in any subsequent litigation with the landlord, or agrees that no action or failure to act by the landlord shall be construed as a constructive eviction, shall be deemed to be against public policy and void.If a tenant is removed from the premises or excluded therefrom by the landlord or his agent except pursuant to a valid court order, the tenant may recover possession or terminate the rental agreement and, in either case, recover three months' rent or three times the damages sustained by him, and the cost of suit, including reasonable attorney's fees.Any agreement or understanding between a landlord and a tenant which purports to exempt the landlord from any liability imposed by this section shall be deemed to be against public policy and void. Section 15F. Any provision of a lease or other rental agreement relating to residential real property whereby the tenant agrees to waive his right to trial by jury in any subsequent litigation with the landlord, or agrees that no action or failure to act by the landlord shall be construed as a constructive eviction, shall be deemed to be against public policy and void. If a tenant is removed from the premises or excluded therefrom by the landlord or his agent except pursuant to a valid court order, the tenant may recover possession or terminate the rental agreement and, in either case, recover three months' rent or three times the damages sustained by him, and the cost of suit, including reasonable attorney's fees. Any agreement or understanding between a landlord and a tenant which purports to exempt the landlord from any liability imposed by this section shall be deemed to be against public policy and void.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 16",
    "section_title": "Section 16",
    "text": "Section 16. Any provision of a lease or other rental agreement relating to real property whereby a lessee or tenant enters into a covenant, agreement or contract, by the use of any words whatsoever, the effect of which is to terminate, or to provide that the lessor or landlord may terminate, such lease or agreement if the tenant has or shall have a child or children, who shall occupy the premises covered by such lease or agreement, shall be deemed to be against public policy and void.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 17",
    "section_title": "Section 17",
    "text": "Section 17. For the purposes of this chapter, chapter one hundred and eleven and chapter two hundred and thirty-nine, occupancy of a dwelling unit within premises licensed as a rooming house or lodging house, except for fraternities, sororities and dormitories of educational institutions, for three consecutive months shall constitute a tenancy at will; provided, however, that if the rent for occupancy in such premises is payable either daily or weekly, seven days written notice to the occupant shall be sufficient to terminate the tenancy where the tenant is committing or permitting to exist a nuisance in or is causing substantial damage to the rental unit, or is creating substantial damage to the rental unit, or is creating a substantial interference with the comfort, safety, or enjoyment of the landlord or other occupants of the accommodation; and provided, further, that the notice shall specify the nuisance or interference. Occupancy of a dwelling unit within a rooming house or lodging house, except for fraternities, sororities and dormitories of educational institutions, for more than thirty consecutive days and less than three consecutive months, or within a fraternity, sorority or dormitory of an educational institution for any length of time, may only be terminated by seven days' notice in writing to the occupant by the operator of such dwelling unit.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 17A",
    "section_title": "Section 17A",
    "text": "Section 17A. (a) Section 18 of chapter 184, section 17 of this chapter and chapter 239 shall apply to a lawful housing occupant who is a client in a program of residential care and services licensed, funded or operated by the department of mental health and who: (1) pays the program for such residential care and services; (2) receives care and services from the program in a housing unit equipped with a kitchen and bathroom; and (3) occupies the unit either alone or with the occupant's family, as defined in the regulations of the department.(b) Said section 18 of said chapter 184 and said section 17 of this chapter and said chapter 239 shall not apply to an occupant in a program of residential care and services which does not satisfy the conditions established in subsection (a) if, before eviction, the occupant received the procedural protections contained in subsection (c).(c) (1) A provider of a program of residential care and services which does not satisfy the conditions established in subsection (a) shall post in each residence of the program a clearly visible notice which explains in plain and simple language the rights of occupants under this subsection.(2) Any such provider who seeks the eviction of an occupant shall provide to the occupant and to the department written notice of the grounds of the proposed eviction, including reasons, relevant facts and the sources of those facts. The notice shall contain a reference to this section and shall advise the occupant that he has the right to a hearing, to be represented at such hearing by a lawyer or other person of his own choosing. At the request of the occupant, the provider shall afford the occupant, or his representative, reasonable access to review and copy his file before the hearing, including any document intended to be used against him at the hearing.(3) Upon receipt of notice from the provider, the department shall immediately assign an impartial hearing officer to conduct a hearing on the propriety of the proposed eviction. The hearing officer shall select a hearing location convenient to the provider and occupant and shall conduct the hearing not less than 4 business days and not later than 14 business days after receipt of the proposed eviction notice, unless the provider and occupant jointly request an alternate date. The provider and the occupant may be represented by an attorney or other person and shall be afforded the opportunity to present evidence, to examine adverse evidence and to examine and cross examine witnesses.(4) The provider shall have the burden of proving, by a preponderance of evidence, the propriety of the proposed eviction, but all such evidence shall be within the scope of the reasons for eviction set forth in the notice required by paragraph (2). An eviction under this section shall be deemed proper if the occupant has substantially violated an essential provision of a written agreement containing the conditions of occupancy or if the occupant is likely, in spite of reasonable accommodation, to impair the emotional or physical well being of other occupants, program staff or neighbors.(5) Within 10 days after the conclusion of the hearing, the hearing officer shall prepare a written decision containing findings of fact and conclusions of law based on the evidence received at the hearing and shall submit copies of the decision, together with a notice of appeal rights, to the occupant and provider. The decision may be appealed to the superior court pursuant to section 14 of chapter 30A.(6) Before the receipt of a written decision involving a client in a program funded or operated by the department, the provider may request that the department provide additional staffing or other assistance to protect the emotional or physical well being of other occupants, program staff or neighbors. Upon receipt of such request, the department shall provide timely assistance as it deems reasonable and appropriate.(7) Upon receipt of a hearing officer's decision confirming the propriety of a proposed eviction of a client of the department who would otherwise become homeless, the department shall take steps to assist the client to secure alternative housing in the least restrictive setting that is appropriate and available.(d) Nothing in this section shall: (1) restrict a provider from initiating an eviction proceeding under chapter 239 if the department fails to conduct a timely hearing pursuant to paragraph (3) of subsection (c); (2) apply to any facility for the care and treatment of mentally ill or mentally retarded persons or to restrict the temporary removal of an occupant under section 12 of chapter 123; (3) apply to a continuing care facility as defined in paragraph (u) of section 1 of chapter 40D or a facility as provided in section 71 of chapter 111; (4) diminish the rights of a lawful occupant of an assisted living facility; or (5) diminish or alter any other occupant rights or privileges not specifically set forth in this section.(e) The superior court, housing court and district court departments shall have jurisdiction to enforce this section and the department may be made a party to an action brought pursuant to this section. Section 17A. (a) Section 18 of chapter 184, section 17 of this chapter and chapter 239 shall apply to a lawful housing occupant who is a client in a program of residential care and services licensed, funded or operated by the department of mental health and who: (1) pays the program for such residential care and services; (2) receives care and services from the program in a housing unit equipped with a kitchen and bathroom; and (3) occupies the unit either alone or with the occupant's family, as defined in the regulations of the department. (b) Said section 18 of said chapter 184 and said section 17 of this chapter and said chapter 239 shall not apply to an occupant in a program of residential care and services which does not satisfy the conditions established in subsection (a) if, before eviction, the occupant received the procedural protections contained in subsection (c). (c) (1) A provider of a program of residential care and services which does not satisfy the conditions established in subsection (a) shall post in each residence of the program a clearly visible notice which explains in plain and simple language the rights of occupants under this subsection. (2) Any such provider who seeks the eviction of an occupant shall provide to the occupant and to the department written notice of the grounds of the proposed eviction, including reasons, relevant facts and the sources of those facts. The notice shall contain a reference to this section and shall advise the occupant that he has the right to a hearing, to be represented at such hearing by a lawyer or other person of his own choosing. At the request of the occupant, the provider shall afford the occupant, or his representative, reasonable access to review and copy his file before the hearing, including any document intended to be used against him at the hearing. (3) Upon receipt of notice from the provider, the department shall immediately assign an impartial hearing officer to conduct a hearing on the propriety of the proposed eviction. The hearing officer shall select a hearing location convenient to the provider and occupant and shall conduct the hearing not less than 4 business days and not later than 14 business days after receipt of the proposed eviction notice, unless the provider and occupant jointly request an alternate date. The provider and the occupant may be represented by an attorney or other person and shall be afforded the opportunity to present evidence, to examine adverse evidence and to examine and cross examine witnesses. (4) The provider shall have the burden of proving, by a preponderance of evidence, the propriety of the proposed eviction, but all such evidence shall be within the scope of the reasons for eviction set forth in the notice required by paragraph (2). An eviction under this section shall be deemed proper if the occupant has substantially violated an essential provision of a written agreement containing the conditions of occupancy or if the occupant is likely, in spite of reasonable accommodation, to impair the emotional or physical well being of other occupants, program staff or neighbors. (5) Within 10 days after the conclusion of the hearing, the hearing officer shall prepare a written decision containing findings of fact and conclusions of law based on the evidence received at the hearing and shall submit copies of the decision, together with a notice of appeal rights, to the occupant and provider. The decision may be appealed to the superior court pursuant to section 14 of chapter 30A. (6) Before the receipt of a written decision involving a client in a program funded or operated by the department, the provider may request that the department provide additional staffing or other assistance to protect the emotional or physical well being of other occupants, program staff or neighbors. Upon receipt of such request, the department shall provide timely assistance as it deems reasonable and appropriate. (7) Upon receipt of a hearing officer's decision confirming the propriety of a proposed eviction of a client of the department who would otherwise become homeless, the department shall take steps to assist the client to secure alternative housing in the least restrictive setting that is appropriate and available. (d) Nothing in this section shall: (1) restrict a provider from initiating an eviction proceeding under chapter 239 if the department fails to conduct a timely hearing pursuant to paragraph (3) of subsection (c); (2) apply to any facility for the care and treatment of mentally ill or mentally retarded persons or to restrict the temporary removal of an occupant under section 12 of chapter 123; (3) apply to a continuing care facility as defined in paragraph (u) of section 1 of chapter 40D or a facility as provided in section 71 of chapter 111; (4) diminish the rights of a lawful occupant of an assisted living facility; or (5) diminish or alter any other occupant rights or privileges not specifically set forth in this section. (e) The superior court, housing court and district court departments shall have jurisdiction to enforce this section and the department may be made a party to an action brought pursuant to this section.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 18",
    "section_title": "Section 18",
    "text": "Section 18. Any person or agent thereof who threatens to or takes reprisals against any tenant of residential premises for the tenant's act of, commencing, proceeding with, or obtaining relief in any judicial or administrative action the purpose of which action is to obtain damages under, or otherwise enforce, any federal, state or local law, regulation, by-law or ordinance, which has as its objective the regulation of residential premises; or exercising the tenant's rights pursuant to section one hundred and twenty-four D of chapter one hundred and sixty-four; or reporting to the board of health or, in the city of Boston to the commissioner of housing inspection or to any other board having as its objective the regulation of residential premises a violation or a suspected violation of any health or building code or of any other municipal by-law or ordinance, or state or federal law or regulation which has as its objective the regulation of residential premises; or reporting or complaining of such violation or suspected violation in writing to the landlord or to the agent of the landlord; or for organizing or joining a tenants' union or similar organization, or for making or expressing an intention to make, a payment of rent to an organization of unit owners pursuant to paragraph (c) of section six of chapter one hundred and eighty-three A shall be liable for damages which shall not be less than one month's rent or more than three month's rent, or the actual damages sustained by the tenant, whichever is greater, and the costs of the suit, including a reasonable attorney's fee.The receipt of any notice of termination of tenancy, except for nonpayment of rent, or, of increase in rent, or, of any substantial alteration in the terms of tenancy within six months after the tenant has commenced, proceeded with, or obtained relief in such action, exercised such rights, made such report or complaint, or organized or joined such tenants' union or within six months after any other person has taken such action or actions on behalf of the tenant or in, or relating to, the building in which the tenant resides, shall create a rebuttable presumption that such notice or other action is a reprisal against the tenant for engaging in such activities. Such presumption shall be rebutted only by clear and convincing evidence that such person's action was not a reprisal against the tenant and that such person had sufficient independent justification for taking such action, and would have in fact taken such action, in the same manner and at the same time the action was taken, regardless of tenants engaging in, or the belief that tenants had engaged in, activities protected under this section.Any waiver of this provision in any lease or other rental agreement shall be void and unenforceable. Section 18. Any person or agent thereof who threatens to or takes reprisals against any tenant of residential premises for the tenant's act of, commencing, proceeding with, or obtaining relief in any judicial or administrative action the purpose of which action is to obtain damages under, or otherwise enforce, any federal, state or local law, regulation, by-law or ordinance, which has as its objective the regulation of residential premises; or exercising the tenant's rights pursuant to section one hundred and twenty-four D of chapter one hundred and sixty-four; or reporting to the board of health or, in the city of Boston to the commissioner of housing inspection or to any other board having as its objective the regulation of residential premises a violation or a suspected violation of any health or building code or of any other municipal by-law or ordinance, or state or federal law or regulation which has as its objective the regulation of residential premises; or reporting or complaining of such violation or suspected violation in writing to the landlord or to the agent of the landlord; or for organizing or joining a tenants' union or similar organization, or for making or expressing an intention to make, a payment of rent to an organization of unit owners pursuant to paragraph (c) of section six of chapter one hundred and eighty-three A shall be liable for damages which shall not be less than one month's rent or more than three month's rent, or the actual damages sustained by the tenant, whichever is greater, and the costs of the suit, including a reasonable attorney's fee. The receipt of any notice of termination of tenancy, except for nonpayment of rent, or, of increase in rent, or, of any substantial alteration in the terms of tenancy within six months after the tenant has commenced, proceeded with, or obtained relief in such action, exercised such rights, made such report or complaint, or organized or joined such tenants' union or within six months after any other person has taken such action or actions on behalf of the tenant or in, or relating to, the building in which the tenant resides, shall create a rebuttable presumption that such notice or other action is a reprisal against the tenant for engaging in such activities. Such presumption shall be rebutted only by clear and convincing evidence that such person's action was not a reprisal against the tenant and that such person had sufficient independent justification for taking such action, and would have in fact taken such action, in the same manner and at the same time the action was taken, regardless of tenants engaging in, or the belief that tenants had engaged in, activities protected under this section. Any waiver of this provision in any lease or other rental agreement shall be void and unenforceable.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 19",
    "section_title": "Section 19",
    "text": "Section 19. A landlord or lessor of any real estate except an owner-occupied two- or three-family dwelling shall, within a reasonable time following receipt of a written notice from a tenant forwarded by registered or certified mail of an unsafe condition, not caused by the tenant, his invitee, or any one occupying through or under the tenant, exercise reasonable care to correct the unsafe condition described in said notice except that such notice need not be given for unsafe conditions in that portion of the premises not under control of the tenant. The tenant or any person rightfully on said premises injured as a result of the failure to correct said unsafe condition within a reasonable time shall have a right of action in tort against the landlord or lessor for damages. Any waiver of this provision in any lease or other rental agreement for residential use shall be void and unenforceable. The notice requirement of this section shall be satisfied by a notice from a board of health or other code enforcement agency to a landlord or lessor of residential premises not exempted by the provisions of this section of a violation of the state sanitary code or other applicable by-laws, ordinances, rules or regulations.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 20",
    "section_title": "Section 20",
    "text": "Section 20. Whenever a lease of residential property shall provide that in any action or summary proceeding the landlord may recover attorneys' fees and expenses incurred as the result of the failure of the tenant to perform any covenant or agreement contained in such lease, or that amounts paid by the landlord therefor shall be paid by the tenant as additional rent, there shall be implied in such lease a covenant by the landlord to pay to the tenant the reasonable attorneys' fees and expenses incurred by the tenant as the result of the failure of the landlord to perform any covenant or agreement on its part to be performed under the lease or in the successful defense of any action or summary proceeding commenced by the landlord against the tenant arising out of the lease, and an agreement that such fees and expenses may be recovered as provided by law in an action commenced against the landlord or by way of counterclaim in any action or summary proceeding commenced by the landlord against the tenant. Any waiver of this section shall be void as against public policy.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 21",
    "section_title": "Section 21",
    "text": "Section 21. The landlord or lessor of any residential or commercial property, upon the written request of any tenant or lawful occupant, of any code or other law enforcement official or of any official of the municipality in which the property is situated, shall disclose in writing within fifteen days of such request the name of the company insuring the property against loss or damage by fire and the amount of insurance provided by each such company and the name of any person who would receive payment for a loss covered by such insurance. Whoever violates the provisions of this section shall be punished by a fine of not more than five hundred dollars. A waiver of this section in any lease or other rental agreement shall be void and unenforceable.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 22",
    "section_title": "Section 22",
    "text": "Section 22. (a) For the purposes of this section the following words shall have the following meanings:—''Common area'', any portion of a building with more than 1 dwelling unit that is not incorporated within a dwelling unit.''Customer service charge'', a fixed amount charged by a city or town or water company for providing water to a building.''Dwelling unit'', any house or building, or portion thereof, that is occupied, designed to be occupied, or is rented, leased or hired out to be occupied, as a home or residence of one or more persons.''Landlord'', the owner, lessor or sublessor of a dwelling unit, the building of which it is a part, or the premises wherein a customer receives water service through metered measurement.''Submetering'', use of a meter by a landlord who receives water from a water company, which meter measures water supplied to a dwelling unit to enable the landlord to charge the tenant of the dwelling unit separately for water usage, or which meter measures water supplied to a common area.''Water company'', a company, as defined in section 1 of chapter 165 or a municipal utility or any other waterworks system owned, leased, maintained, operated, managed or controlled by any unit of local government under any general or special law, which company, utility or system supplies water to a landlord through metered measurement. Any landlord imposing charges on tenants or otherwise engaging in any activity permitted under this section shall not be deemed thereby to be functioning as a water company as defined herein or to be subject to any laws or regulations regulating any such company.''Water conservation device'', for all showers, shower stalls, shower compartments or shower baths, a low-flow showerhead which shall have a maximum flow rate not exceeding 2 1/2 gallons of water per minute, for all faucets a maximum flow rate not exceeding 2 and 2/10 gallons of water per minute and for all water closets, ultra-low-flush water closets not exceeding 1 and 6/10 gallons of water per flush, contained within a dwelling unit.(b) A landlord may cause to be installed by a plumber licensed in the commonwealth, at the expense of such landlord, submetering equipment in the landlord's building to measure the quantity of water provided for the exclusive use of each dwelling unit, provided that such equipment meets the standards of accuracy and testing of the American Water Works Association or a similar accredited association; and provided further, that a submeter is installed for each dwelling unit in the building and for the common areas of the building, so that all water used in a building is measured by both a primary meter and a submeter.(c) A landlord may charge a tenant of a dwelling unit for water usage as measured through the use of submetering equipment only in accordance with this section and only upon the landlord certifying that the dwelling unit is in compliance with this section to a board of health, health department or other municipal agency or department charged with enforcement of the state sanitary code. All provisions of this section allowing landlords to charge tenants for water usage shall also be deemed to apply to sewer service charges calculated by means of the same primary meter or submeter. Certification by the landlord shall be provided under the penalties of perjury and shall include a statement that: 1) the dwelling unit is eligible for the imposition on the tenant of a charge for water usage in accordance with paragraph (d); 2) all showerheads, faucets, and water closets in the dwelling unit are water conservation devices and that all water closets were installed by a licensed plumber; and 3) the water submeter measuring the use of water in the dwelling unit was installed by a licensed plumber and is in compliance with the standards of accuracy and testing referenced in subsection (b).(d) A dwelling unit shall become eligible for the imposition on the tenant of a charge for water usage only upon the commencement of a new tenancy in such dwelling unit and only if: (1) the dwelling unit is being occupied for the first time; or (2) the previous tenant vacated the dwelling unit voluntarily, or was evicted from the dwelling unit for nonpayment of rent or for breach of lease or noncompliance with a rental agreement for the dwelling unit; provided, however, that a dwelling unit shall not be deemed eligible for submetering if the new tenant relocated involuntarily from another dwelling unit in the same building or building complex; and provided further, that once a tenant of a dwelling unit has been charged for the use of water in accordance with this section, such dwelling unit shall remain eligible for the imposition of a charge for the use of water in all subsequent tenancies; and provided further, that a licensed plumber employed by or under contract with the landlord may perform any work in a dwelling unit as is required by this section to allow for the imposition on a tenant of a charge for the use of water, even if such unit is occupied by a tenant upon whom a charge for the use of water cannot be imposed.(e) A landlord may not charge the tenant of a dwelling unit separately for water usage measured by a submeter, nor allow such tenant to be so charged, unless the submeter measures only water that is supplied for the exclusive use of the particular dwelling unit and only to an area within the exclusive possession and control of the tenant of such dwelling unit and does not measure any water usage for any portion of the common areas or by any other party or dwelling unit; provided further, that a landlord shall not charge such tenant for water supplied through a submeter to the dwelling unit prior to the landlord installing fully functional water conservation devices for all faucets, showerheads and water closets in the dwelling unit; and provided further, that the landlord shall ensure that such water conservation devices are installed and functioning properly at the commencement of each subsequent tenancy in such dwelling unit.(f) A landlord may not charge the tenant separately, nor allow tenant to be charged separately, for submetered water usage unless the tenant has signed a written rental agreement that clearly and conspicuously provides for such separate charge and that fully discloses in plain language the details of the water submetering and billing arrangement between the landlord and the tenant. Each bill for submetered water usage shall clearly set forth all charges and all other relevant information, including, but not limited to, the current and immediately preceding submeter readings and the date of each such reading, the amount of water consumed since the last reading, the charge per unit of water, the total charge and the payment due date. Such charges shall be billed to the tenant in at leased as many periods as the landlord is billed by the water company providing such water to the building or such payments may be made on a monthly payment schedule as agreed to in the written rental agreement; provided, however, that if the landlord bills the tenant on a monthly basis, payment of the bill by the tenant shall be due 15 days after the date the bill is mailed to the tenant, but if the landlord bills the tenant at intervals greater than 1 month, payment of the bill by the tenant shall be due 30 days after the date the bill is mailed to the tenant. If the tenant fails to make such payment, such nonpayment shall be a material breach of the written rental agreement. Violation of such breach may be cured by payment of the water charges in full prior to any court hearing to adjudicate such violation.(g) A landlord shall determine a calculated cost per unit of water consumption by dividing the total amount of any bill or invoice provided to the landlord from the water company for water usage, the customer service charge and taxes, but not including any interest for the late payment, penalty fees or other discretionary assessments or charges, for all water provided to the premises through the water company meter in that billing period, by the total amount of water consumption for the entire premises. The total amount charged separately to each submetered dwelling unit for water usage for any billing period shall not exceed such calculated cost per unit of water multiplied by the number of units of water delivered exclusively to the particular dwelling unit for the same billing period, provided that the landlord has verified that the total amounts of water usage measured by all submeters in the building, including all submeters for common areas, does not exceed the total amount of water usage in the building for the same billing period as shown on such bill or invoice.(h) Whenever a tenancy in a dwelling unit commences after the beginning, but before the end, of a billing period for which the landlord has not been billed by the water company, the landlord shall mail to the tenant on the first day of such tenancy the reading on the submeter for the dwelling unit as of that day. The landlord may thereafter bill the tenant only for the water measured on the submeter subsequent to such reading.(i) Whenever a tenancy in a dwelling unit terminates after the beginning, but before the end, of a billing period for which the landlord has not been billed by the water company, the landlord shall give to the tenant on the last day of such tenancy the reading on the submeter for the dwelling unit as of that day together with a final bill for water usage in the dwelling unit since the last prior reading of the submeter for such dwelling unit. The landlord shall charge the same rate for the water used by the tenant as the water company charged in the last bill issued to the landlord. Notwithstanding paragraph (f), the bill shall be immediately due and payable by the tenant. If the tenant does not pay the bill, the landlord may deduct the amount of the bill from any security deposit paid by the tenant in accordance with section 15B of chapter 186, prior to returning the balance of the security deposit, if any, to the tenant. If the landlord is not able to give the final reading on the submeter for the dwelling unit together with a final bill for water usage to the tenant on the last day of the tenancy, the landlord shall mail such reading and such final bill to the tenant no later than the day after the termination of the tenancy. If the water company subsequently charges the landlord a lesser rate than the landlord charged the tenant in the final bill, the landlord shall recalculate the bill forthwith based on the lesser rate and mail to the tenant the revised bill together with a rebate for any overpayment made by the tenant.(j) A landlord shall not charge or recover, or allow to be charged or recovered, any additional servicing, administrative, establishment, meter-reading, meter-testing, billing, or submetering fee or other fee whatsoever, however denominated.(k) Water usage separately charged to tenants pursuant to this section shall be delivered by the water company to the landlord and such landlord shall:— (1) be the consumer; (2) for billing purposes, be the customer of record; (3) be responsible for payment of the water company bills; and (4) be subject to any actions of the water company for nonpayment.(l) In the event of nonpayment of a bill to a water company by the landlord, such water company shall have all the remedies against the customer of the water company available pursuant to any law, rule or regulation. A landlord may not shut off or refuse water service to a tenant on the basis that the tenant has not paid a separately assessed submetered water usage charge.(m) The landlord shall retain an affirmative obligation to maintain in good working order the water supply system to each dwelling unit and any component thereof, including any water conservation device and submeter installed pursuant to this section, and to respond in a timely manner to any request by the tenant for the repair of any defect or malfunctioning in such water supply system, including any leak. Such water supply system to any dwelling unit and any component thereof including, but not limited to, any water conservation device and submeter installed pursuant to this section, shall be governed by and maintained in accordance with the state sanitary code. In the event of any overcharge by the landlord or any violation of the state sanitary code, the tenant shall have all rights and remedies provided under law for such overcharges or such violations including, but not limited to, the rights and remedies provided under chapters 111, 186 and 239.(n) Upon receipt of a bill for water usage from the landlord and within the time allowed for paying the bill, a tenant may request that a person or entity with expertise in the installation and operation of water submeters and with no financial or other relationship with the landlord, test the submeter for the dwelling unit leased by the tenant to determine whether it is accurately measuring the water being used in the dwelling unit. If the submeter is found to be measuring more water than is being used in the dwelling unit, the landlord shall install a new submeter at his own expense and shall also pay for the cost of the test. In addition, the person or entity conducting the test shall determine as accurately as possible the amount of water that was improperly measured by the submeter in both the prior and current billing periods. The landlord shall calculate the amount the tenant was overcharged for the prior billing period and reduce the bill by that amount, or, if the tenant has already paid the bill, give the tenant a rebate in that amount. Upon receipt from the water company of the bill for the current billing period, the landlord shall calculate the amount of the bill attributable to the excessive measurement by the submeter and reduce the bill to the tenant by that amount prior to sending it to the tenant. If the submeter is found to be measuring no more water than is being used in the dwelling unit, the tenant shall pay for the cost of the test; provided, however, that if the tenant does not pay for the cost of the test, the landlord may add such cost to the next bill sent to the tenant and such cost shall be considered a part of the bill for purposes of paragraph (f) and clause (i) of subsection (4) of section 15B of chapter 186.(o) In the event of a repair of a leak in the water supply system to a dwelling unit, the landlord shall determine as accurately as possible the amount of water that was measured on the submeter for the dwelling unit as a result of such leak, after a review of the billing records for the dwelling unit and consultation with the licensed plumber repairing the leak. The landlord shall then determine the amount of the bill for the billing period in which the leak occurred that was attributable to such leak and reduce the bill to the tenant by that amount or, if such bill has already been paid, grant the tenant a rebate in that amount; provided, however, that with regard to any leak about which the tenant knew or should have known, the landlord shall only be required to reduce the bill to the tenant, or to grant a rebate to the tenant, by or in an amount attributable to the water usage measured on the submeter as a result of the leak between the date the tenant gave notice to the landlord of the leak and the date the leak was repaired.(p) A landlord may impose a charge for water use on the tenant of a dwelling unit that is connected directly to a meter installed by a water company; provided that the meter measures only water that is supplied for the exclusive use of the dwelling unit and only to an area within the exclusive possession and control of the tenant of such dwelling unit and does not measure water usage for any portion of any common area or by any other party or dwelling unit. The landlord and tenant shall have all of the same rights and obligations with respect to water charges for such dwelling unit that landlords and tenants have under this section with respect to water charges for any dwelling unit connected to a submeter; provided, however, that the landlord shall not be required to include in the certificate required by subsection (c) the information required by clause (3) of said subsection (c) for dwelling units connected to a submeter; and provided further, that subsection (n) shall not apply to dwelling units connected directly to a meter installed by a water company. Upon a request by the tenant of a dwelling unit connected directly to a meter installed by a water company, the landlord shall apply for a test of the meter to determine its accuracy in accordance with section 10 of chapter 165. The test shall be conducted in accordance with said section 10. The tenant shall reimburse the landlord for any cost incurred in connection with such test. If the tenant does not reimburse the landlord for such cost, the landlord may add such cost to the next bill sent to the tenant and such cost shall be considered to be part of the bill for purposes of subsection (f) and clause (i) of subsection (4) of section 15B of chapter 186.(q) Nothing in this section shall be construed to increase or expand, change, eliminate, reduce or otherwise limit the liabilities or obligations of any water company that are set forth in any law, rule, regulation or order to the tenant of a dwelling unit who is receiving water provided to the building by the water company.(r) Nothing in this section shall affect or impair the powers and duties of the department of environmental protection or the department of public health with respect to water supply under chapter 111.(s) No charge for water usage may be imposed on the tenant of any dwelling unit in a public housing development pursuant to chapter 200 of the acts of 1948, chapter 667 of the acts of 1954, chapter 705 of the acts of 1966, or chapter 689 of the acts of 1974.(t) The department of public health shall promulgate such additional regulations to the state sanitary code as it determines to be necessary to implement this section. Section 22. (a) For the purposes of this section the following words shall have the following meanings:— ''Common area'', any portion of a building with more than 1 dwelling unit that is not incorporated within a dwelling unit. ''Customer service charge'', a fixed amount charged by a city or town or water company for providing water to a building. ''Dwelling unit'', any house or building, or portion thereof, that is occupied, designed to be occupied, or is rented, leased or hired out to be occupied, as a home or residence of one or more persons. ''Landlord'', the owner, lessor or sublessor of a dwelling unit, the building of which it is a part, or the premises wherein a customer receives water service through metered measurement. ''Submetering'', use of a meter by a landlord who receives water from a water company, which meter measures water supplied to a dwelling unit to enable the landlord to charge the tenant of the dwelling unit separately for water usage, or which meter measures water supplied to a common area. ''Water company'', a company, as defined in section 1 of chapter 165 or a municipal utility or any other waterworks system owned, leased, maintained, operated, managed or controlled by any unit of local government under any general or special law, which company, utility or system supplies water to a landlord through metered measurement. Any landlord imposing charges on tenants or otherwise engaging in any activity permitted under this section shall not be deemed thereby to be functioning as a water company as defined herein or to be subject to any laws or regulations regulating any such company. ''Water conservation device'', for all showers, shower stalls, shower compartments or shower baths, a low-flow showerhead which shall have a maximum flow rate not exceeding 2 1/2 gallons of water per minute, for all faucets a maximum flow rate not exceeding 2 and 2/10 gallons of water per minute and for all water closets, ultra-low-flush water closets not exceeding 1 and 6/10 gallons of water per flush, contained within a dwelling unit. (b) A landlord may cause to be installed by a plumber licensed in the commonwealth, at the expense of such landlord, submetering equipment in the landlord's building to measure the quantity of water provided for the exclusive use of each dwelling unit, provided that such equipment meets the standards of accuracy and testing of the American Water Works Association or a similar accredited association; and provided further, that a submeter is installed for each dwelling unit in the building and for the common areas of the building, so that all water used in a building is measured by both a primary meter and a submeter. (c) A landlord may charge a tenant of a dwelling unit for water usage as measured through the use of submetering equipment only in accordance with this section and only upon the landlord certifying that the dwelling unit is in compliance with this section to a board of health, health department or other municipal agency or department charged with enforcement of the state sanitary code. All provisions of this section allowing landlords to charge tenants for water usage shall also be deemed to apply to sewer service charges calculated by means of the same primary meter or submeter. Certification by the landlord shall be provided under the penalties of perjury and shall include a statement that: 1) the dwelling unit is eligible for the imposition on the tenant of a charge for water usage in accordance with paragraph (d); 2) all showerheads, faucets, and water closets in the dwelling unit are water conservation devices and that all water closets were installed by a licensed plumber; and 3) the water submeter measuring the use of water in the dwelling unit was installed by a licensed plumber and is in compliance with the standards of accuracy and testing referenced in subsection (b). (d) A dwelling unit shall become eligible for the imposition on the tenant of a charge for water usage only upon the commencement of a new tenancy in such dwelling unit and only if: (1) the dwelling unit is being occupied for the first time; or (2) the previous tenant vacated the dwelling unit voluntarily, or was evicted from the dwelling unit for nonpayment of rent or for breach of lease or noncompliance with a rental agreement for the dwelling unit; provided, however, that a dwelling unit shall not be deemed eligible for submetering if the new tenant relocated involuntarily from another dwelling unit in the same building or building complex; and provided further, that once a tenant of a dwelling unit has been charged for the use of water in accordance with this section, such dwelling unit shall remain eligible for the imposition of a charge for the use of water in all subsequent tenancies; and provided further, that a licensed plumber employed by or under contract with the landlord may perform any work in a dwelling unit as is required by this section to allow for the imposition on a tenant of a charge for the use of water, even if such unit is occupied by a tenant upon whom a charge for the use of water cannot be imposed.",
    "chunk_index": 1,
    "total_chunks": 2
  },
  {
    "chapter": "186",
    "section": "Section 22",
    "section_title": "Section 22",
    "text": "(e) A landlord may not charge the tenant of a dwelling unit separately for water usage measured by a submeter, nor allow such tenant to be so charged, unless the submeter measures only water that is supplied for the exclusive use of the particular dwelling unit and only to an area within the exclusive possession and control of the tenant of such dwelling unit and does not measure any water usage for any portion of the common areas or by any other party or dwelling unit; provided further, that a landlord shall not charge such tenant for water supplied through a submeter to the dwelling unit prior to the landlord installing fully functional water conservation devices for all faucets, showerheads and water closets in the dwelling unit; and provided further, that the landlord shall ensure that such water conservation devices are installed and functioning properly at the commencement of each subsequent tenancy in such dwelling unit. (f) A landlord may not charge the tenant separately, nor allow tenant to be charged separately, for submetered water usage unless the tenant has signed a written rental agreement that clearly and conspicuously provides for such separate charge and that fully discloses in plain language the details of the water submetering and billing arrangement between the landlord and the tenant. Each bill for submetered water usage shall clearly set forth all charges and all other relevant information, including, but not limited to, the current and immediately preceding submeter readings and the date of each such reading, the amount of water consumed since the last reading, the charge per unit of water, the total charge and the payment due date. Such charges shall be billed to the tenant in at leased as many periods as the landlord is billed by the water company providing such water to the building or such payments may be made on a monthly payment schedule as agreed to in the written rental agreement; provided, however, that if the landlord bills the tenant on a monthly basis, payment of the bill by the tenant shall be due 15 days after the date the bill is mailed to the tenant, but if the landlord bills the tenant at intervals greater than 1 month, payment of the bill by the tenant shall be due 30 days after the date the bill is mailed to the tenant. If the tenant fails to make such payment, such nonpayment shall be a material breach of the written rental agreement. Violation of such breach may be cured by payment of the water charges in full prior to any court hearing to adjudicate such violation. (g) A landlord shall determine a calculated cost per unit of water consumption by dividing the total amount of any bill or invoice provided to the landlord from the water company for water usage, the customer service charge and taxes, but not including any interest for the late payment, penalty fees or other discretionary assessments or charges, for all water provided to the premises through the water company meter in that billing period, by the total amount of water consumption for the entire premises. The total amount charged separately to each submetered dwelling unit for water usage for any billing period shall not exceed such calculated cost per unit of water multiplied by the number of units of water delivered exclusively to the particular dwelling unit for the same billing period, provided that the landlord has verified that the total amounts of water usage measured by all submeters in the building, including all submeters for common areas, does not exceed the total amount of water usage in the building for the same billing period as shown on such bill or invoice. (h) Whenever a tenancy in a dwelling unit commences after the beginning, but before the end, of a billing period for which the landlord has not been billed by the water company, the landlord shall mail to the tenant on the first day of such tenancy the reading on the submeter for the dwelling unit as of that day. The landlord may thereafter bill the tenant only for the water measured on the submeter subsequent to such reading. (i) Whenever a tenancy in a dwelling unit terminates after the beginning, but before the end, of a billing period for which the landlord has not been billed by the water company, the landlord shall give to the tenant on the last day of such tenancy the reading on the submeter for the dwelling unit as of that day together with a final bill for water usage in the dwelling unit since the last prior reading of the submeter for such dwelling unit. The landlord shall charge the same rate for the water used by the tenant as the water company charged in the last bill issued to the landlord. Notwithstanding paragraph (f), the bill shall be immediately due and payable by the tenant. If the tenant does not pay the bill, the landlord may deduct the amount of the bill from any security deposit paid by the tenant in accordance with section 15B of chapter 186, prior to returning the balance of the security deposit, if any, to the tenant. If the landlord is not able to give the final reading on the submeter for the dwelling unit together with a final bill for water usage to the tenant on the last day of the tenancy, the landlord shall mail such reading and such final bill to the tenant no later than the day after the termination of the tenancy. If the water company subsequently charges the landlord a lesser rate than the landlord charged the tenant in the final bill, the landlord shall recalculate the bill forthwith based on the lesser rate and mail to the tenant the revised bill together with a rebate for any overpayment made by the tenant. (j) A landlord shall not charge or recover, or allow to be charged or recovered, any additional servicing, administrative, establishment, meter-reading, meter-testing, billing, or submetering fee or other fee whatsoever, however denominated. (k) Water usage separately charged to tenants pursuant to this section shall be delivered by the water company to the landlord and such landlord shall:— (1) be the consumer; (2) for billing purposes, be the customer of record; (3) be responsible for payment of the water company bills; and (4) be subject to any actions of the water company for nonpayment. (l) In the event of nonpayment of a bill to a water company by the landlord, such water company shall have all the remedies against the customer of the water company available pursuant to any law, rule or regulation. A landlord may not shut off or refuse water service to a tenant on the basis that the tenant has not paid a separately assessed submetered water usage charge. (m) The landlord shall retain an affirmative obligation to maintain in good working order the water supply system to each dwelling unit and any component thereof, including any water conservation device and submeter installed pursuant to this section, and to respond in a timely manner to any request by the tenant for the repair of any defect or malfunctioning in such water supply system, including any leak. Such water supply system to any dwelling unit and any component thereof including, but not limited to, any water conservation device and submeter installed pursuant to this section, shall be governed by and maintained in accordance with the state sanitary code. In the event of any overcharge by the landlord or any violation of the state sanitary code, the tenant shall have all rights and remedies provided under law for such overcharges or such violations including, but not limited to, the rights and remedies provided under chapters 111, 186 and 239. (n) Upon receipt of a bill for water usage from the landlord and within the time allowed for paying the bill, a tenant may request that a person or entity with expertise in the installation and operation of water submeters and with no financial or other relationship with the landlord, test the submeter for the dwelling unit leased by the tenant to determine whether it is accurately measuring the water being used in the dwelling unit. If the submeter is found to be measuring more water than is being used in the dwelling unit, the landlord shall install a new submeter at his own expense and shall also pay for the cost of the test. In addition, the person or entity conducting the test shall determine as accurately as possible the amount of water that was improperly measured by the submeter in both the prior and current billing periods. The landlord shall calculate the amount the tenant was overcharged for the prior billing period and reduce the bill by that amount, or, if the tenant has already paid the bill, give the tenant a rebate in that amount. Upon receipt from the water company of the bill for the current billing period, the landlord shall calculate the amount of the bill attributable to the excessive measurement by the submeter and reduce the bill to the tenant by that amount prior to sending it to the tenant. If the submeter is found to be measuring no more water than is being used in the dwelling unit, the tenant shall pay for the cost of the test; provided, however, that if the tenant does not pay for the cost of the test, the landlord may add such cost to the next bill sent to the tenant and such cost shall be considered a part of the bill for purposes of paragraph (f) and clause (i) of subsection (4) of section 15B of chapter 186. (o) In the event of a repair of a leak in the water supply system to a dwelling unit, the landlord shall determine as accurately as possible the amount of water that was measured on the submeter for the dwelling unit as a result of such leak, after a review of the billing records for the dwelling unit and consultation with the licensed plumber repairing the leak. The landlord shall then determine the amount of the bill for the billing period in which the leak occurred that was attributable to such leak and reduce the bill to the tenant by that amount or, if such bill has already been paid, grant the tenant a rebate in that amount; provided, however, that with regard to any leak about which the tenant knew or should have known, the landlord shall only be required to reduce the bill to the tenant, or to grant a rebate to the tenant, by or in an amount attributable to the water usage measured on the submeter as a result of the leak between the date the tenant gave notice to the landlord of the leak and the date the leak was repaired. (p) A landlord may impose a charge for water use on the tenant of a dwelling unit that is connected directly to a meter installed by a water company; provided that the meter measures only water that is supplied for the exclusive use of the dwelling unit and only to an area within the exclusive possession and control of the tenant of such dwelling unit and does not measure water usage for any portion of any common area or by any other party or dwelling unit. The landlord and tenant shall have all of the same rights and obligations with respect to water charges for such dwelling unit that landlords and tenants have under this section with respect to water charges for any dwelling unit connected to a submeter; provided, however, that the landlord shall not be required to include in the certificate required by subsection (c) the information required by clause (3) of said subsection (c) for dwelling units connected to a submeter; and provided further, that subsection (n) shall not apply to dwelling units connected directly to a meter installed by a water company. Upon a request by the tenant of a dwelling unit connected directly to a meter installed by a water company, the landlord shall apply for a test of the meter to determine its accuracy in accordance with section 10 of chapter 165. The test shall be conducted in accordance with said section 10. The tenant shall reimburse the landlord for any cost incurred in connection with such test. If the tenant does not reimburse the landlord for such cost, the landlord may add such cost to the next bill sent to the tenant and such cost shall be considered to be part of the bill for purposes of subsection (f) and clause (i) of subsection (4) of section 15B of chapter 186. (q) Nothing in this section shall be construed to increase or expand, change, eliminate, reduce or otherwise limit the liabilities or obligations of any water company that are set forth in any law, rule, regulation or order to the tenant of a dwelling unit who is receiving water provided to the building by the water company. (r) Nothing in this section shall affect or impair the powers and duties of the department of environmental protection or the department of public health with respect to water supply under chapter 111. (s) No charge for water usage may be imposed on the tenant of any dwelling unit in a public housing development pursuant to chapter 200 of the acts of 1948, chapter 667 of the acts of 1954, chapter 705 of the acts of 1966, or chapter 689 of the acts of 1974. (t) The department of public health shall promulgate such additional regulations to the state sanitary code as it determines to be necessary to implement this section.",
    "chunk_index": 2,
    "total_chunks": 2
  },
  {
    "chapter": "186",
    "section": "Section 23",
    "section_title": "Section 23",
    "text": "Section 23. (a) As used in sections 23 to 29, inclusive, the following words shall, unless the context clearly requires otherwise, have the following meanings:—''Co-tenant'', a person who shares the legal obligation to pay rent or use and occupancy for the premises with a tenant and who occupies the premises.''Domestic violence'', the occurrence of 1 or more of the following acts between family or member of a household:(i) attempting to cause or causing physical harm;(ii) placing another in fear of imminent serious physical harm;(iii) causing another to engage involuntarily in sexual relations by force, threat or duress.''Housing subsidy provider'', a local housing authority, agency or other entity providing or administering a federal or state rental subsidy within the commonwealth under applicable law.''Member of the household'', a person residing with a tenant or co-tenant as an authorized occupant of the premises. In the case of an application for housing, such term shall include a person identified by the applicant as a proposed household member who would be living with the applicant in the premises.''Owner'', as defined in 105 C.M.R. 410.020.''Qualified third party'', a police officer, as defined by section 1 of chapter 90C, law enforcement professional including, but not limited to, a district attorney, assistant district attorney, a victim-witness advocate, probation or parole officer; an employee of the Victims Services Unit of the department of criminal justice information services; an application assistant in the address confidentiality program of the state secretary under section 2 of chapter 9A; a licensed medical care provider; an employee of the department of children and families or the department of transitional assistance charged with providing direct service to clients, or a manager or designated domestic violence or abuse advocate within either department; an active licensed social worker; a licensed mental health professional; a sexual assault counselor as defined in section 20J of chapter 233; or a domestic violence victims' counselor as defined in section 20K of said chapter 233.''Quitting date'', the date that a tenant or co-tenant surrenders such person's interest in the premises; provided further, that such date shall be determined as: (i) if the tenant or co-tenant has vacated the premises, the date notice is given to the owner of the intent to abandon the premises and not to return; or (ii) if the tenant or co-tenant has not vacated the premises, either (A) the date the tenant or co-tenant intends to vacate the premises or (B) the actual date that the tenant or co-tenant has vacated after providing such notice.''Rape'', as set forth in sections 22, 22A, 22B, 22C, 23, 23A, 23B, 24 or 24B of chapter 265 or sections 2, 3 or 17 of chapter 272.''Sexual assault'', as set forth in sections 13B, 13B1/2, 13B3/4, 13F, 13H or 13K of chapter 265 or section 35A of chapter 272.''Stalking'', stalking as set forth in section 43 of chapter 265 or criminal harassment as set forth in sections 43 or 43A of chapter 265.''Tenant'', (i) a person who has entered into an oral or written lease or rental agreement with the owner or (ii) a person who remains on the premises after such person's tenancy has terminated or after the expiration of such person's lease. Section 23. (a) As used in sections 23 to 29, inclusive, the following words shall, unless the context clearly requires otherwise, have the following meanings:— ''Co-tenant'', a person who shares the legal obligation to pay rent or use and occupancy for the premises with a tenant and who occupies the premises. ''Domestic violence'', the occurrence of 1 or more of the following acts between family or member of a household: (i) attempting to cause or causing physical harm; (ii) placing another in fear of imminent serious physical harm; (iii) causing another to engage involuntarily in sexual relations by force, threat or duress. ''Housing subsidy provider'', a local housing authority, agency or other entity providing or administering a federal or state rental subsidy within the commonwealth under applicable law. ''Member of the household'', a person residing with a tenant or co-tenant as an authorized occupant of the premises. In the case of an application for housing, such term shall include a person identified by the applicant as a proposed household member who would be living with the applicant in the premises. ''Owner'', as defined in 105 C.M.R. 410.020. ''Qualified third party'', a police officer, as defined by section 1 of chapter 90C, law enforcement professional including, but not limited to, a district attorney, assistant district attorney, a victim-witness advocate, probation or parole officer; an employee of the Victims Services Unit of the department of criminal justice information services; an application assistant in the address confidentiality program of the state secretary under section 2 of chapter 9A; a licensed medical care provider; an employee of the department of children and families or the department of transitional assistance charged with providing direct service to clients, or a manager or designated domestic violence or abuse advocate within either department; an active licensed social worker; a licensed mental health professional; a sexual assault counselor as defined in section 20J of chapter 233; or a domestic violence victims' counselor as defined in section 20K of said chapter 233. ''Quitting date'', the date that a tenant or co-tenant surrenders such person's interest in the premises; provided further, that such date shall be determined as: (i) if the tenant or co-tenant has vacated the premises, the date notice is given to the owner of the intent to abandon the premises and not to return; or (ii) if the tenant or co-tenant has not vacated the premises, either (A) the date the tenant or co-tenant intends to vacate the premises or (B) the actual date that the tenant or co-tenant has vacated after providing such notice. ''Rape'', as set forth in sections 22, 22A, 22B, 22C, 23, 23A, 23B, 24 or 24B of chapter 265 or sections 2, 3 or 17 of chapter 272. ''Sexual assault'', as set forth in sections 13B, 13B1/2, 13B3/4, 13F, 13H or 13K of chapter 265 or section 35A of chapter 272. ''Stalking'', stalking as set forth in section 43 of chapter 265 or criminal harassment as set forth in sections 43 or 43A of chapter 265. ''Tenant'', (i) a person who has entered into an oral or written lease or rental agreement with the owner or (ii) a person who remains on the premises after such person's tenancy has terminated or after the expiration of such person's lease.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 24",
    "section_title": "Section 24",
    "text": "Section 24. (a) A tenant or co-tenant may terminate a rental agreement or tenancy and quit the premises upon written notification to the owner that a member of the household is a victim of domestic violence, rape, sexual assault or stalking, if such notification is made within 3 months of the most recent act of domestic violence, rape, sexual assault or stalking; or if a member of a tenant's household is reasonably in fear of imminent serious physical harm from domestic violence, rape, sexual assault or stalking. An owner shall have the right to request proof of the status as a victim of domestic violence, rape, sexual assault or stalking, including the name of the perpetrator, if known, as provided in subsection (e).(b) Within 3 months of written notification to the owner to terminate a rental agreement or tenancy under subsection (a), a tenant, co-tenant or any household member who is not the perpetrator of the domestic violence, rape, sexual assault or stalking shall quit the premises. If the tenant or co-tenant fails to quit the premises within 3 months, the notice to terminate the rental agreement or tenancy shall be void.(c) A tenant or co-tenant to whom this section applies shall be discharged from liability for rent or use and occupancy for 30 days or 1 full rental period after the quitting date, whichever last occurs, to the extent that a rental agreement and applicable law may otherwise impose such liability beyond the quitting date. Such tenant or co-tenant shall be entitled to a refund of any prepaid rent for any period thereafter. The tenant or co-tenant shall receive a full and specific statement of the basis for retaining any of the security deposit together with any refund due in compliance with section 15B within 30 days of the conclusion of the tenancy and the delivery of full possession of the leased premises by all occupants to the landlord.(d) No other tenant or co-tenant who is a party to the rental agreement shall be released from such tenant's or co-tenant's obligations under the rental agreement or other obligations under this chapter. If the tenant or co-tenant to whom this section applies vacates but leaves belongings, such belongings shall be deemed abandoned and may be disposed of under applicable law, unless the tenant or co-tenant indicates in writing the responsibility for such belongings and the action to be taken with respect to such belongings. If the tenant or co-tenant to whom this section applies vacates, but another person remains in the premises other than another tenant or co-tenant, nothing in this section shall affect the owner's rights and obligations with regard to such remaining person. A landlord who in good faith initiates an action against a remaining tenant, co-tenant or household member, or a housing subsidy provider who terminates or denies a rental subsidy to a remaining tenant, co-tenant or household member, or takes any other action under this section, shall not be subject to a claim of retaliation or any other claim under this chapter.(e) If relief is sought because of recent or ongoing domestic violence, rape, sexual assault or stalking, an owner may request that proof be provided to show that a protective order or third-party verification is in effect or was obtained within the prior 3 months, or a tenant or co-tenant is reasonably in fear of imminent serious physical harm. Proof of status as a victim of domestic violence, rape, sexual assault or stalking shall be satisfied by production of any 1 of the following documents:(1) a copy of a valid protection order under chapter 209A or 258E obtained by the tenant, co-tenant or member of the household;(2) a record from a federal, state or local court or law enforcement of an act of domestic violence, rape, sexual assault or stalking and the name of the perpetrator if known; or(3) a written verification from any other qualified third party to whom the tenant, co-tenant or member of the tenant or co-tenant's household reported the domestic violence, rape, sexual assault or stalking; provided, however, that the verification shall include the name of the organization, agency, clinic or professional service provider and include the date of the domestic violence, rape, sexual assault or stalking, and the name of the perpetrator if known; and provided, further, that any adult victim who has the capacity to do so shall provide a statement, under the penalty of perjury, that the incident described in such verification is true and correct.(f) An owner or housing subsidy provider who obtains written proof of status as a victim of domestic violence, rape, sexual assault or stalking shall keep such documentation and the information contained in the documentation confidential, and shall not provide or allow access to such documentation in any way to any other person or agency, unless the victim provides written authorization for the release of such information or unless required by court order, government regulation or governmental audit requirements. Section 24. (a) A tenant or co-tenant may terminate a rental agreement or tenancy and quit the premises upon written notification to the owner that a member of the household is a victim of domestic violence, rape, sexual assault or stalking, if such notification is made within 3 months of the most recent act of domestic violence, rape, sexual assault or stalking; or if a member of a tenant's household is reasonably in fear of imminent serious physical harm from domestic violence, rape, sexual assault or stalking. An owner shall have the right to request proof of the status as a victim of domestic violence, rape, sexual assault or stalking, including the name of the perpetrator, if known, as provided in subsection (e). (b) Within 3 months of written notification to the owner to terminate a rental agreement or tenancy under subsection (a), a tenant, co-tenant or any household member who is not the perpetrator of the domestic violence, rape, sexual assault or stalking shall quit the premises. If the tenant or co-tenant fails to quit the premises within 3 months, the notice to terminate the rental agreement or tenancy shall be void. (c) A tenant or co-tenant to whom this section applies shall be discharged from liability for rent or use and occupancy for 30 days or 1 full rental period after the quitting date, whichever last occurs, to the extent that a rental agreement and applicable law may otherwise impose such liability beyond the quitting date. Such tenant or co-tenant shall be entitled to a refund of any prepaid rent for any period thereafter. The tenant or co-tenant shall receive a full and specific statement of the basis for retaining any of the security deposit together with any refund due in compliance with section 15B within 30 days of the conclusion of the tenancy and the delivery of full possession of the leased premises by all occupants to the landlord. (d) No other tenant or co-tenant who is a party to the rental agreement shall be released from such tenant's or co-tenant's obligations under the rental agreement or other obligations under this chapter. If the tenant or co-tenant to whom this section applies vacates but leaves belongings, such belongings shall be deemed abandoned and may be disposed of under applicable law, unless the tenant or co-tenant indicates in writing the responsibility for such belongings and the action to be taken with respect to such belongings. If the tenant or co-tenant to whom this section applies vacates, but another person remains in the premises other than another tenant or co-tenant, nothing in this section shall affect the owner's rights and obligations with regard to such remaining person. A landlord who in good faith initiates an action against a remaining tenant, co-tenant or household member, or a housing subsidy provider who terminates or denies a rental subsidy to a remaining tenant, co-tenant or household member, or takes any other action under this section, shall not be subject to a claim of retaliation or any other claim under this chapter. (e) If relief is sought because of recent or ongoing domestic violence, rape, sexual assault or stalking, an owner may request that proof be provided to show that a protective order or third-party verification is in effect or was obtained within the prior 3 months, or a tenant or co-tenant is reasonably in fear of imminent serious physical harm. Proof of status as a victim of domestic violence, rape, sexual assault or stalking shall be satisfied by production of any 1 of the following documents: (1) a copy of a valid protection order under chapter 209A or 258E obtained by the tenant, co-tenant or member of the household; (2) a record from a federal, state or local court or law enforcement of an act of domestic violence, rape, sexual assault or stalking and the name of the perpetrator if known; or (3) a written verification from any other qualified third party to whom the tenant, co-tenant or member of the tenant or co-tenant's household reported the domestic violence, rape, sexual assault or stalking; provided, however, that the verification shall include the name of the organization, agency, clinic or professional service provider and include the date of the domestic violence, rape, sexual assault or stalking, and the name of the perpetrator if known; and provided, further, that any adult victim who has the capacity to do so shall provide a statement, under the penalty of perjury, that the incident described in such verification is true and correct. (f) An owner or housing subsidy provider who obtains written proof of status as a victim of domestic violence, rape, sexual assault or stalking shall keep such documentation and the information contained in the documentation confidential, and shall not provide or allow access to such documentation in any way to any other person or agency, unless the victim provides written authorization for the release of such information or unless required by court order, government regulation or governmental audit requirements.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 25",
    "section_title": "Section 25",
    "text": "Section 25. An owner shall not refuse to enter into a rental agreement, nor shall a housing subsidy provider deny assistance, based on an applicant having terminated a rental agreement under section 24 or based upon an applicant having requested a change of locks under section 26.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 26",
    "section_title": "Section 26",
    "text": "Section 26. (a) For purposes of this section, the term ''household member'' shall mean a person residing with the tenant or co-tenant as an authorized occupant of the premises, and who is 18 years of age or older or an emancipated minor.(b) An owner shall, upon the request of a tenant, co-tenant or a household member, change the locks of the individual dwelling unit in which the tenant, co-tenant or household member lives if the tenant, co-tenant or household member reasonably believes that the tenant, co-tenant or household member is under an imminent threat of domestic violence, rape, sexual assault or stalking at the premises. An owner shall have the right to request, in good faith, proof of the status as a victim of domestic violence, rape, sexual assault or stalking, including the name of the perpetrator, if known, as provided in subsection (e) of section 24.(c) If the threat of domestic violence, rape, sexual assault or stalking is posed by a person who is a tenant, co-tenant or household member, the owner may change the locks and deny a key to the alleged perpetrator upon receipt of a request to change the locks; provided, however, that such request shall be accompanied by: (i) a copy of a valid protective order issued under chapter 209A or chapter 258E issued against a tenant, co-tenant or household member; or (ii) a record from a federal, state or local court or law enforcement, indicating that a tenant, co-tenant or household member thereof poses an imminent threat of domestic violence, rape, sexual assault or stalking.(d) An owner who has received notice of a request for change of locks under this section shall, within 2 business days, make a good faith effort to change the locks or give the tenant, co-tenant or household member permission to change the locks. If the owner changes the locks, the owner shall make a good faith effort to give a key to the new locks to the tenant, co-tenant or household member requesting the lock change as soon as possible, but within the same 2 business day period. An owner may charge a fee for the expense of changing the locks. The fee shall not exceed the reasonable price customarily charged for changing such locks in that community.(e) If an owner fails to change the locks after receipt of a request under this section within 2 business days, the tenant, co-tenant or household member may change the locks without the owner's permission. If the rental agreement requires that the owner retain a key to the leased residential premises and if a tenant, co-tenant or household member changes the locks, the tenant, co-tenant or household member shall make a good faith effort to provide a key to the new locks to the owner within 2 business days of the locks being changed. If a tenant, co-tenant or household member changes the locks without the owner's permission, such person shall change the locks in a workmanlike manner with locks of similar or better quality than the original locks. An owner may replace a lock installed by the tenant, co-tenant or household member, or seek reimbursement for additional costs incurred, if the owner believes that the locks were not of equal or better quality or were not installed properly, and such action shall be deemed not to be in retaliation.(f) If the locks are changed under this section, a tenant, co-tenant or household member shall not voluntarily give the new key to the perpetrator.  An owner who refuses to provide a key to any person based on the reasonable belief that such person is the perpetrator of alleged domestic violence, rape, sexual assault or stalking, shall not be liable for such refusal.(g) An owner who takes action to prevent the tenant, co-tenant or household member who has complied with subsection (b) from changing the locks, or any owner who changes the locks but fails to make a good faith effort to provide a key to the tenant, co-tenant or household member requesting the lock change as provided in subsection (d), shall be liable for actual and consequential damages or 3 months' rent, whichever is greater, and the costs of the action, including reasonable attorneys' fees, all of which may be applied in setoff or recoupment against any claim for rent owed or owing for use and occupancy.  Damages shall not be imposed if the court determines that the owner acted in good faith. Section 26. (a) For purposes of this section, the term ''household member'' shall mean a person residing with the tenant or co-tenant as an authorized occupant of the premises, and who is 18 years of age or older or an emancipated minor. (b) An owner shall, upon the request of a tenant, co-tenant or a household member, change the locks of the individual dwelling unit in which the tenant, co-tenant or household member lives if the tenant, co-tenant or household member reasonably believes that the tenant, co-tenant or household member is under an imminent threat of domestic violence, rape, sexual assault or stalking at the premises. An owner shall have the right to request, in good faith, proof of the status as a victim of domestic violence, rape, sexual assault or stalking, including the name of the perpetrator, if known, as provided in subsection (e) of section 24. (c) If the threat of domestic violence, rape, sexual assault or stalking is posed by a person who is a tenant, co-tenant or household member, the owner may change the locks and deny a key to the alleged perpetrator upon receipt of a request to change the locks; provided, however, that such request shall be accompanied by: (i) a copy of a valid protective order issued under chapter 209A or chapter 258E issued against a tenant, co-tenant or household member; or (ii) a record from a federal, state or local court or law enforcement, indicating that a tenant, co-tenant or household member thereof poses an imminent threat of domestic violence, rape, sexual assault or stalking. (d) An owner who has received notice of a request for change of locks under this section shall, within 2 business days, make a good faith effort to change the locks or give the tenant, co-tenant or household member permission to change the locks. If the owner changes the locks, the owner shall make a good faith effort to give a key to the new locks to the tenant, co-tenant or household member requesting the lock change as soon as possible, but within the same 2 business day period. An owner may charge a fee for the expense of changing the locks. The fee shall not exceed the reasonable price customarily charged for changing such locks in that community. (e) If an owner fails to change the locks after receipt of a request under this section within 2 business days, the tenant, co-tenant or household member may change the locks without the owner's permission. If the rental agreement requires that the owner retain a key to the leased residential premises and if a tenant, co-tenant or household member changes the locks, the tenant, co-tenant or household member shall make a good faith effort to provide a key to the new locks to the owner within 2 business days of the locks being changed. If a tenant, co-tenant or household member changes the locks without the owner's permission, such person shall change the locks in a workmanlike manner with locks of similar or better quality than the original locks. An owner may replace a lock installed by the tenant, co-tenant or household member, or seek reimbursement for additional costs incurred, if the owner believes that the locks were not of equal or better quality or were not installed properly, and such action shall be deemed not to be in retaliation. (f) If the locks are changed under this section, a tenant, co-tenant or household member shall not voluntarily give the new key to the perpetrator.  An owner who refuses to provide a key to any person based on the reasonable belief that such person is the perpetrator of alleged domestic violence, rape, sexual assault or stalking, shall not be liable for such refusal. (g) An owner who takes action to prevent the tenant, co-tenant or household member who has complied with subsection (b) from changing the locks, or any owner who changes the locks but fails to make a good faith effort to provide a key to the tenant, co-tenant or household member requesting the lock change as provided in subsection (d), shall be liable for actual and consequential damages or 3 months' rent, whichever is greater, and the costs of the action, including reasonable attorneys' fees, all of which may be applied in setoff or recoupment against any claim for rent owed or owing for use and occupancy.  Damages shall not be imposed if the court determines that the owner acted in good faith.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 27",
    "section_title": "Section 27",
    "text": "Section 27. The superior court, housing court, district court and Boston municipal court shall have jurisdiction in equity to restrain violations of sections 23 to 26, inclusive. Section 18 of this chapter and section 2A of chapter 239 shall apply to an act taken in reprisal against a person for requesting that locks be changed under section 26.Notwithstanding sections 23 to 26, inclusive, if a court has issued a protective order under chapter 209A, or any other law, ordering a tenant, co-tenant or member of the household to vacate the dwelling unit, the owner shall not interfere with the order and upon a request to change the locks as described in section 26, shall comply with such request. Section 27. The superior court, housing court, district court and Boston municipal court shall have jurisdiction in equity to restrain violations of sections 23 to 26, inclusive. Section 18 of this chapter and section 2A of chapter 239 shall apply to an act taken in reprisal against a person for requesting that locks be changed under section 26. Notwithstanding sections 23 to 26, inclusive, if a court has issued a protective order under chapter 209A, or any other law, ordering a tenant, co-tenant or member of the household to vacate the dwelling unit, the owner shall not interfere with the order and upon a request to change the locks as described in section 26, shall comply with such request.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 28",
    "section_title": "Section 28",
    "text": "Section 28. A waiver of sections 23 to 27, inclusive, in any lease or other rental agreement, except as otherwise provided by law or by federal, state or local regulation shall be void and unenforceable.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 29",
    "section_title": "Section 29",
    "text": "Section 29. (a) An owner complying with sections 23 to 28, inclusive, or with the requirements of an order under chapter 209A or any other law, shall be relieved of any liability to the vacated tenant, co-tenant or member of the tenant's household, or to any other third party on account of the owner's good faith compliance with a court order or changing the locks as provided in section 26 including, but not limited to, withholding a key from the alleged perpetrator, as provided in subsection (c) of section 26. Damages shall not be imposed if the court determines that the matter was of a good faith dispute between the owner and tenants.(b) Notwithstanding any general or special law to the contrary, any owner who demonstrates that such owner's conduct constituted a good faith effort to comply with sections 23 to 29, inclusive, shall not be liable for multiple damages or for attorney's fees. Section 29. (a) An owner complying with sections 23 to 28, inclusive, or with the requirements of an order under chapter 209A or any other law, shall be relieved of any liability to the vacated tenant, co-tenant or member of the tenant's household, or to any other third party on account of the owner's good faith compliance with a court order or changing the locks as provided in section 26 including, but not limited to, withholding a key from the alleged perpetrator, as provided in subsection (c) of section 26. Damages shall not be imposed if the court determines that the matter was of a good faith dispute between the owner and tenants. (b) Notwithstanding any general or special law to the contrary, any owner who demonstrates that such owner's conduct constituted a good faith effort to comply with sections 23 to 29, inclusive, shall not be liable for multiple damages or for attorney's fees.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 30",
    "section_title": "Section 30",
    "text": "Section 30. Not more than 3 days after a property owner or a lessor knew or should have known that a property has been vacated through termination of tenancy, abandonment or other removal or exclusion of a tenant from the premises under this chapter or chapter 186A, the property owner, lessor or a designee shall inspect the property for the presence of abandoned animals.If the property owner, lessor or a designee encounters an abandoned animal, that person shall immediately notify an animal control officer as defined in section 136A of chapter 140, a police officer or other authorized agent of the presence and condition of the animal.The property owner, lessor or a designee who encounters an abandoned animal under this section shall not be considered the owner, possessor or person having charge or custody of the animal under section 77 of chapter 272.For the purposes of this section, an animal shall be considered abandoned if it is found on or in a property vacated through termination of tenancy, abandonment or other removal or exclusion of a tenant from the premises under this chapter or said chapter 186A.If the property owner, lessor or designee fails to comply with this section, the lessor or property owner shall be subject to a civil penalty of not more than $500 for a first offense and not more than $1,000 for a second or subsequent offense. Funds collected under this section shall be deposited into the Homeless Animal Prevention and Care Fund established in section 35WW of chapter 10. Section 30. Not more than 3 days after a property owner or a lessor knew or should have known that a property has been vacated through termination of tenancy, abandonment or other removal or exclusion of a tenant from the premises under this chapter or chapter 186A, the property owner, lessor or a designee shall inspect the property for the presence of abandoned animals. If the property owner, lessor or a designee encounters an abandoned animal, that person shall immediately notify an animal control officer as defined in section 136A of chapter 140, a police officer or other authorized agent of the presence and condition of the animal. The property owner, lessor or a designee who encounters an abandoned animal under this section shall not be considered the owner, possessor or person having charge or custody of the animal under section 77 of chapter 272. For the purposes of this section, an animal shall be considered abandoned if it is found on or in a property vacated through termination of tenancy, abandonment or other removal or exclusion of a tenant from the premises under this chapter or said chapter 186A. If the property owner, lessor or designee fails to comply with this section, the lessor or property owner shall be subject to a civil penalty of not more than $500 for a first offense and not more than $1,000 for a second or subsequent offense. Funds collected under this section shall be deposited into the Homeless Animal Prevention and Care Fund established in section 35WW of chapter 10.",
    "chunk_index": 1,
    "total_chunks": 1
  },
  {
    "chapter": "186",
    "section": "Section 31",
    "section_title": "Section 31",
    "text": "Section 31. (a) A notice to quit for nonpayment of rent given in writing by a landlord to a residential tenant pursuant to this chapter shall be accompanied by a form that shall include, but not be limited to:  (i) documentation of any agreements between the tenant and landlord for the tenant to repay the landlord for nonpayment of rent;  and (ii) information on:  (1) rental assistance programs including, but not limited to, the residential assistance for families in transition program;  (2) applicable trial court rules, standing orders or emergency administrative orders pertaining to actions for summary process;  and (3) any relevant federal or state legal restrictions on residential evictions.  The form shall also prominently display the following statement:\"THIS NOTICE TO QUIT IS NOT AN EVICTION.  YOU DO NOT NEED TO IMMEDIATELY LEAVE YOUR UNIT.  YOU ARE ENTITLED TO A LEGAL PROCEEDING IN WHICH YOU CAN DEFEND AGAINST THE EVICTION. ONLY A COURT ORDER CAN FORCE YOU TO LEAVE YOUR UNIT.''[ Subsection (b) effective until May 30, 2023.  For text effective May 30, 2023, see below.](b) The executive office of housing and economic development shall develop the form required pursuant to this section and make it publicly available on its website.  The information in clause (ii) of subsection (a) shall be made available in the 5 most common languages spoken in the commonwealth in addition to English.  No court having jurisdiction over an action for summary process pursuant to chapter 239, including the Boston municipal court department, shall, in an eviction for nonpayment of rent for a residential dwelling unit, accept for filing a writ, summons or complaint without proof of delivery of the form required under this section.[ Subsection (b) as amended by 2023, 7, Sec. 296 effective May 30, 2023.  See 2023, 7, Sec. 298.  For text effective until May 30, 2023, see above.](b) The executive office of housing and livable communities shall develop the form required pursuant to this section and make it publicly available on its website.  The information in clause (ii) of subsection (a) shall be made available in the 5 most common languages spoken in the commonwealth in addition to English.  No court having jurisdiction over an action for summary process pursuant to chapter 239, including the Boston municipal court department, shall, in an eviction for nonpayment of rent for a residential dwelling unit, accept for filing a writ, summons or complaint without proof of delivery of the form required under this section. Section 31. (a) A notice to quit for nonpayment of rent given in writing by a landlord to a residential tenant pursuant to this chapter shall be accompanied by a form that shall include, but not be limited to:  (i) documentation of any agreements between the tenant and landlord for the tenant to repay the landlord for nonpayment of rent;  and (ii) information on:  (1) rental assistance programs including, but not limited to, the residential assistance for families in transition program;  (2) applicable trial court rules, standing orders or emergency administrative orders pertaining to actions for summary process;  and (3) any relevant federal or state legal restrictions on residential evictions.  The form shall also prominently display the following statement: \"THIS NOTICE TO QUIT IS NOT AN EVICTION.  YOU DO NOT NEED TO IMMEDIATELY LEAVE YOUR UNIT.  YOU ARE ENTITLED TO A LEGAL PROCEEDING IN WHICH YOU CAN DEFEND AGAINST THE EVICTION. ONLY A COURT ORDER CAN FORCE YOU TO LEAVE YOUR UNIT.'' [ Subsection (b) effective until May 30, 2023.  For text effective May 30, 2023, see below.] (b) The executive office of housing and economic development shall develop the form required pursuant to this section and make it publicly available on its website.  The information in clause (ii) of subsection (a) shall be made available in the 5 most common languages spoken in the commonwealth in addition to English.  No court having jurisdiction over an action for summary process pursuant to chapter 239, including the Boston municipal court department, shall, in an eviction for nonpayment of rent for a residential dwelling unit, accept for filing a writ, summons or complaint without proof of delivery of the form required under this section. [ Subsection (b) as amended by 2023, 7, Sec. 296 effective May 30, 2023.  See 2023, 7, Sec. 298.  For text effective until May 30, 2023, see above.] (b) The executive office of housing and livable communities shall develop the form required pursuant to this section and make it publicly available on its website.  The information in clause (ii) of subsection (a) shall be made available in the 5 most common languages spoken in the commonwealth in addition to English.  No court having jurisdiction over an action for summary process pursuant to chapter 239, including the Boston municipal court department, shall, in an eviction for nonpayment of rent for a residential dwelling unit, accept for filing a writ, summons or complaint without proof of delivery of the form required under this section.",
    "chunk_index": 1,
    "total_chunks": 1
  }
]